using System;
using System.Collections;
using System.Collections.Generic;
using System.Drawing;
using System.Runtime.InteropServices;
using System.Security;
using System.Text;
using System.Threading;
using System.Windows.Forms;
using ArcClientEngine.ArcCaches;
using ArcClientEngine.ArcCfg;
using ArcClientEngine.ArcCfg.Filters;
using ArcClientEngine.ArcCfg.OldHighlightCode;
using ArcClientEngine.CmdProcessing;
using ArcClientEngine.CmdProcessing.UserCmds;
using ArcInterfaces.Io;
using ArcShared;
using ArcShared.ArcDatabase;
using ZedGraph;

namespace Ⴀ;

internal sealed class ႥႥ
{
	[StructLayout(LayoutKind.Explicit, Pack = 1, Size = 3798)]
	private struct Ⴓ
	{
	}

	[StructLayout(LayoutKind.Explicit, Pack = 1, Size = 3680)]
	private struct ႤႤ
	{
	}

	internal List<UserCmdCfg> Ⴈ;

	private static readonly object Ⴄ;

	private static readonly object Ⴗ;

	private static readonly Array Ⴃ;

	internal static Ⴓ Ⴐ/* Not supported: data(7E 2E 7C 2E 7E 2E FE 1C FE 31 E4 84 EA 84 E5 84 6D AE 45 B6 0D 9B 96 AB 30 AD 26 AC 09 A3 20 81 49 AE 7F B6 44 9B 8D AB 2E AD 1A AC 32 DC 39 DC 30 DC 94 C3 51 F3 E0 F5 EB F4 FD FB E1 D9 AD F6 FD EE A7 C3 67 F3 DD F5 47 89 43 89 44 89 16 A6 A9 A0 A5 A1 A5 AE C2 47 C5 47 C6 47 5F 75 73 58 B0 68 0C 6E 00 6F 1C 60 27 42 38 7F 32 7F 3D 7F FB 56 E1 57 D5 58 FC 7A 95 55 A3 4D 98 60 51 50 F2 56 C6 57 99 07 92 07 9F 07 43 20 41 02 3E 2D 35 35 3F 18 FA 28 57 2E 40 2F 58 20 5F 02 02 2D 5E 30 54 30 59 30 91 02 EF 2F 30 1F 87 19 92 18 93 17 C8 35 CF 1A E5 02 C9 2F 86 76 97 76 8E 76 02 5E 4C 51 55 73 3D 5C 1A 44 37 69 E3 59 53 5F 59 5E 58 51 10 73 3D 5C 0C 44 3C 69 E9 59 50 5F 0B 5E FC F8 EC F8 F5 F8 46 E7 95 D7 2F D1 22 D0 3C DF 2F FD 40 D2 6B CA 6D E7 DA D7 3E D1 15 D0 72 DF 3E FD 71 D2 40 CA FB B0 FC B0 F1 B0 13 9A 2E 82 0C AF 98 9F 2F 99 3F 98 39 97 09 DB 08 DB 02 DB 93 F2 C7 7D CD 7D CB 7D 02 78 7D 57 4D 4F 60 62 94 52 5D 54 1D 55 06 5A 39 78 5C 57 B4 49 B5 49 B9 49 C9 66 2A 8A 25 8A 24 8A A0 B8 96 95 4F A5 F1 A3 C4 A2 E7 AD FF 8F 9A A0 81 B8 8A 95 42 A5 F5 A3 EE A2 E8 AD DF 8F C2 0A D7 0A CD 0A 48 38 7E 15 A7 25 19 23 2C 22 18 2D 07 0F 63 20 69 38 71 15 A0 25 30 23 16 22 18 2D 37 0F 7E 20 43 38 73 15 AD 25 14 23 2C 22 C8 23 DD 23 D8 23 42 11 74 3C AD 0C 13 0A 26 0B 07 04 17 26 64 09 42 11 71 3C A7 0C 06 0A 09 0B 13 04 33 26 74 09 49 11 79 3C A7 0C 1E 0A 26 0B C4 57 C5 57 D5 57 D9 6F FC 22 E8 22 EE 22 34 05 23 27 46 08 76 10 7B 3D DA 0D 35 0B 3F 0A 33 05 19 27 14 08 67 10 4E 3D 95 0D 35 0B 3E 0A 20 05 29 27 5D 08 5E 10 32 E3 36 E3 21 E3 E1 E6 97 C9 B4 D1 B2 FC 0D 1B 0F 1B 19 1B E8 04 4D 34 82 93 86 93 97 93 F3 BC 4C BA 40 BB 60 B4 E3 D4 E7 D4 F5 D4 36 FD 20 FC 39 F3 14 D1 10 7F 15 7F 07 7F D3 56 D9 57 DA 58 D3 7A 9A 55 E4 DA F5 DA FC DA 58 F0 78 E8 59 C5 8E F5 7E F3 30 F2 2E FD 36 DF 59 F0 69 E8 10 C5 87 F5 36 F3 3D F2 6A FD 3C DF 63 F0 A6 9B BF 9B BF 9B 7B B2 6A B3 64 BC 76 9E 4E B1 2D A9 1B 84 CC B4 7D B2 7D B3 28 BC 62 9E 0B B1 24 A9 1F 84 C9 B4 77 B2 58 B3 28 BC 58 9E 21 B1 0B A9 43 84 F4 B4 5F B2 10 C6 0A C6 0A C6 C1 C3 B9 EC 93 F4 A2 D9 36 E9 CE EF D8 EE CA E1 D5 C3 AD EC BD F4 E4 D9 64 E9 CF EF D0 EE D3 E1 CF C3 B3 EC AC F4 E4 D9 5E E9 E5 EF FF EE 8F E1 F2 C3 9B EC F6 39 BE 39 ED 39 38 10 34 11 28 1E 33 3C 1E 13 6B 0B 47 26 9D 16 21 10 32 11 33 1E 33 3C 1E 13 7C 0B 56 26 91 16 2F 10 32 11 34 1E 30 3C 4B 13 7D 0B 02 26 91 16 6C 10 3C 11 36 1E 29 3C 4A 13 78 0B 41 26 99 16 28 10 35 11 31 1E 60 3C 59 13 78 0B 4E 26 B6 16 DC 0F C1 0F C0 0F 24 26 15 27 52 28 04 0A 7D 25 13 3D 60 10 AE 20 01 26 1F 27 17 28 18 0A 60 25 40 3D 28 10 B6 20 07 26 1F 27 15 28 03 0A 67 25 13 3D 7A 10 BF 20 0B 26 1C 27 1B 28 01 0A 47 25 A5 79 BC 79 B8 79 1E 53 38 4B 14 66 D7 56 6B 50 67 51 7B 5E 60 7C 4D 53 2F 4B 04 66 D2 56 76 50 66 51 7E 5E 33 7C 0B 53 25 4B 51 66 D1 56 7A 50 6A 51 66 5E 66 7C 23 53 5E E2 19 E2 40 E2 95 C5 9B E7 F7 C8 D3 D0 EB FD 2C CD 85 CB 97 CA D0 C5 86 E7 F1 C8 D8 D0 F9 FD 34 CD 88 CB 92 CA 93 C5 C8 E7 D3 C8 E7 D0 AA FD 2A CD 8B CB D3 CA B3 C5 AB E7 D0 C8 91 D0 EF FD 30 CD 90 CB D3 CA 9E C5 81 E7 B6 C8 DD D0 E6 FD 39 CD A7 CB DD D9 D7 D9 C2 D9 40 EB 6C C6 B9 F6 0A F0 15 F1 1E FE 4B DC 56 F3 7D EB 4F C6 C8 17 CC 17 E8 17 78 08 A7 38 00 3E 22 3F B6 B6 A0 B6 97 B6 3C 84 10 A9 D1 99 79 9F 6A 9E 4B 91 20 B3 1A 9C 30 84 10 A9 F7 99 2C 9F 7F 9E 79 91 65 B3 16 9C 37 84 07 A9 D4 99 65 9F 7A 9E 55 91 6C 5A 69 5A 4E 5A E6 68 CC 45 0B 75 A2 73 92 72 85 38 89 38 A6 38 3F 27 EC 17 56 11 5C 10 48 1F 56 3D 1E 12 4A 0A 1D 27 D1 17 6D 11 69 10 F6 0F FE 0F D2 0F 25 0A 50 25 76 3D 78 10 D0 20 19 26 0F 27 11 28 00 70 0C 70 25 70 AD 5A 9B 42 B5 6F 72 5F C9 59 DF 58 CB 57 C2 75 BC 5A 80 42 A4 6F 75 5F F7 6F F4 6F D1 6F 50 70 9E 40 28 46 68 1E 6F 1E 4F 1E 89 34 FE 2C C8 01 1E 31 BF 37 80 36 EE 39 26 FE 28 FE 0E FE F5 FB 80 D4 A6 CC A8 E1 55 D1 E8 D7 C2 D6 FA D9 F5 FB 9A D4 BD CC 9D E1 50 D1 CF D7 9F 28 9C 28 B6 28 19 1A 2D 37 CA 07 DC B7 DD B7 F6 B7 3A 9F A5 BA A6 BA 8E BA 51 BF 22 90 08 88 DD C9 DE C9 F1 C9 12 FB 33 D6 86 E6 77 38 78 38 5A 38 E8 3D C6 12 EC 0A D3 27 1C 17 A8 11 F2 10 F9 1F FB 3D CD 12 FD 0A D7 27 1D 17 A4 11 9C 10 B5 FB B1 FB 9B FB 09 D1 33 C9 19 E4 F6 D4 A3 94 AB 94 8C 94 41 BC 4E B3 5C 91 45 BE 29 A6 13 8B CA BB 57 BD 35 3F 25 3F 05 3F 8A 20 41 10 E0 16 EF 17 EF 18 E6 3A B3 15 A8 0D 84 20 47 10 FC 16 ED 17 F7 18 C0 3A 85 15 9E 0D A8 9D AC 9D 99 9D 8E B2 32 B4 25 B5 26 BA 97 0E 85 0E A5 0E 19 29 1B 0B 30 24 0C 3C 63 11 E5 21 48 27 49 26 19 29 53 0B 3A 24 0C 3C 2F 11 F8 21 4B 27 1A 26 61 29 65 0B EF A7 F7 A7 DC A7 9A 88 3B 8E 2D 8F 28 80 2D A2 46 8D 72 95 4E B8 8E 88 3C 8E 24 8F 2F 80 36 A2 64 8D 20 95 4F B8 81 88 32 8E 2B 8F 2D 80 31 A2 40 8D 69 95 73 B8 DB D5 D8 D5 EF D5 5B FD 2D F2 3A D0 80 BA 81 BA B5 BA CC 98 E7 CC E3 CC D1 CC 56 D3 97 E3 3C E5 19 E4 FB 9A FA 9A CC 9A F1 AD FF AF FE AF C7 AF 98 A0 23 5D 2F 5D 1A 5D 05 72 FC 74 E6 75 EE 7A F4 58 88 77 EC 6F 8E 42 41 72 FD 74 FB 75 CF 7A 61 AE 3B AE 5B AE B8 89 B8 AB CD 84 E0 9C DC B1 10 81 FB 87 B8 86 A0 89 A7 AB DA 84 AE 9C C8 B1 3E 81 9E 87 87 86 B4 89 F7 AB CC 84 E6 9C C1 B1 47 81 B3 87 AF 86 A1 89 A2 AB C8 84 E2 9C 95 B1 03 81 B5 87 AD 86 EF 89 A3 AB CA 84 EB 9C D9 B1 02 81 A8 87 EC 86 A0 89 A3 AB 89 84 FC 9C D0 B1 13 81 B7 87 A5 86 A9 89 F7 AB C7 84 E1 9C 95 B1 0C 81 B8 87 A5 86 A3 89 94 AB 1B AC 1D AC 20 AC E9 84 FE 8B 98 A9 91 86 B5 9E F3 B3 27 B9 26 B9 1B B9 F8 8B A2 CD AD CD 9F CD 60 C8 19 E7 3C FF 24 D2 CA E2 71 E4 68 E5 63 EA 58 C8 35 E7 06 FF 43 D2 E6 E2 59 E4 33 E5 82 20 99 20 BC 20 03 12 39 3F ED 0F 4C 09 4C 08 49 07 5A 25 24 0A 02 12 35 3F A4 0F 5D 09 4B 08 43 07 5A 25 6A 0A 1F 12 33 3F F0 0F 4B 09 5A 08 40 07 77 25 67 0A 2E 12 04 3F C5 0F DF FC 93 FC E0 FC 78 E3 AD D3 06 D5 17 D4 1F DB 07 F9 78 D6 53 CE 2B E3 BE D3 0B D5 1B D4 16 DB 0E F9 78 D6 5C CE 2B E3 BD D3 0B D5 13 D4 51 DB 1D F9 64 D6 55 CE 7F E3 B7 D3 0A D5 11 D4 51 DB 1B F9 78 D6 56 CE 2B E3 AD D3 17 D5 1D D4 01 DB 49 F9 63 D6 55 CE 65 E3 B5 D3 00 D5 26 D4 9F 16 8C 16 DF 16 51 3F 57 3E 5F 31 07 13 3B 3C 19 24 2A 09 F4 39 60 3F 4B 3E 7C 31 69 13 3B 3C 19 24 2A 09 F4 39 60 3F 4B 3E 7C 31 1D D7 0C D7 5C D7 A1 FD 97 E5 A7 C8 35 F8 D5 FE D5 FF C5 F0 D9 D2 B0 FD 81 E5 B0 C8 76 F8 89 FE DC FF DA F0 CA D2 B8 FD 41 C3 53 C3 03 C3 69 EC 9F EA 89 EB 8B E4 96 C6 E6 E9 C2 F1 B5 DC 34 EC 9E EA 85 EB 9D E4 83 C6 E7 E9 DB F1 FA DC 24 EC DB EA 10 C7 12 C7 53 C7 ED E0 E7 C2 47 EF 45 EF 03 EF EB DD DC F0 A5 51 A9 51 E0 51 10 4E CA 7E 7B 78 6D 79 66 76 19 54 40 7B 23 63 05 4E CF 7E 6A 78 45 79 CB FA 9D FA 8D FA 56 C8 7A E5 B9 D5 1D D3 0F D2 03 DD 5D FF 62 D0 4D C8 7B E5 A8 D5 1C D3 0F D2 11 DD 11 FF 76 D0 49 C8 3F E5 A8 D5 19 D3 12 D2 45 DD 0F FF 6C D0 42 C8 3F E5 B9 D5 1D D3 13 D2 04 DD 1B FF 66 D0 40 C8 3F E5 A8 D5 19 D3 12 D2 45 DD 0F FF 66 D0 50 C8 73 E5 A4 D5 17 D3 46 D2 16 DD 14 FF 6B D0 50 C8 3F E5 A8 D5 1A D3 07 D2 28 DD C6 B3 C0 B3 81 B3 6B 99 5D 81 77 AC AC 9C 19 9A 2F 9B CC E7 DD E7 84 E7 2A CE 0F CF 0B C0 1D E2 6B CD 6F D5 6C F8 A4 C8 13 CE 08 CF 0E C0 39 E2 58 CD 44 D5 7E F8 89 C8 2A CE 95 04 1E 04 DC 04 47 23 03 01 7D 2E 5A 36 61 1B B3 2B 0F 2D 18 2C 1B 23 03 01 7D 2E 17 36 35 1B FB 2B 01 2D 40 2C 7F 23 40 01 2F 2E 3B 36 6E 1B FF 2B 4E 2D 4D 2C 55 23 42 01 10 2E 08 36 24 1B E0 2B 7A 2D 17 2C 0D 23 51 01 38 2E 2C 36 32 1B F0 2B 40 2D 7C 2C 58 23 51 01 1C 2E 55 36 35 1B F6 2B 41 2D 16 2C 50 23 16 01 3F 2E 1B 36 6F 1B E4 2B 58 2D 4F 2C 14 23 0C 01 67 2E 0A 36 35 1B E7 2B 47 2D 18 2C 1B 23 03 01 7D 2E 5A 36 61 1B B3 2B 0F 2D 18 2C 1B 23 03 01 21 2E 0A E5 81 E5 40 E5 BE CF C5 D7 FE FA 2C CA 90 CC 87 CD 84 C2 9C E0 E2 CF C5 D7 FE FA 2C CA 90 CC 87 CD 84 C2 9C E0 E2 CF C5 D7 FE FA 2C CA 90 CC 87 CD 84 C2 C8 E0 A7 CF 8B D7 F0 FA 67 CA 85 CC C5 CD C5 C2 92 E0 B5 CF 92 D7 A9 FA 23 CA 9F CC 9D CD D4 C2 C8 E0 B6 CF 8D D7 FE FA 2C CA 8A CC D3 CD C5 C2 9C E0 AD CF 83 D7 B0 FA 65 CA 90 CC C2 CD D6 C2 D3 E0 8F CF C5 D7 FE FA 2C CA 90 CC 87 CD 84 C2 9C E0 E2 CF C5 D7 FE FA 2C CA 90 CC 87 CD 84 C2 9C E0 E2 CF C5 D7 A2 FA 6D F2 6B F2 26 F2 E1 F7 CB D8 EB C0 DE ED 04 DD BB DB A4 DB B4 DB E8 DB 63 F2 45 F3 46 FC 53 DE 2F F1 19 E9 35 C4 F1 F4 4B F2 72 F3 2A FC 7D DE 00 F1 27 E9 15 C4 EA F4 3F 1A BD 1A 72 1A B3 1F 84 30 B5 28 87 05 49 35 E8 33 F3 32 E9 3D CC 1F D7 30 F0 28 C5 05 5D 35 EB 33 F3 32 FC 3D E4 1F 98 30 B3 28 CB 05 4B 35 E0 33 E6 32 FD 3D E0 1F B1 30 F0 28 B3 05 7D 35 A5 33 E6 32 F4 3D DA 1F D7 30 B5 28 83 05 4D 35 A5 33 FA 32 E5 3D E0 1F 80 30 F0 28 98 05 4B 35 E0 33 E6 32 FD 3D E0 1F 91 30 F0 28 99 05 4C 35 EA 33 EB 32 B1 3D FD 1F 92 30 A3 28 CB 05 5C 35 F6 33 F3 32 F4 3D E5 1F A7 30 32 B5 3C B5 7C B5 B2 92 F6 B0 95 9F AF 87 94 AA 51 9A A8 9C FB 9D F2 92 E5 B0 97 9F B0 87 89 AA 77 9A 6D A2 6F A2 22 A2 FA 90 EE BD EF 9F E9 9F BF 9F 5E B5 74 AD 52 80 9D B0 3B B6 07 B7 6E 31 6C 31 3F 31 3F 1E 97 18 BF FA BC FA ED FA 22 D2 27 DD 38 FF 33 72 31 72 60 72 CB 58 E4 40 0F 6B 0D 6B 5B 6B 39 44 81 42 6F 3A 6D 3A 3A 3A F1 1D EA 3F 02 04 00 04 54 04 DD 36 E4 1B 46 5D 44 5D 11 5D CB 74 DA 75 CD E9 CF E9 95 E9 4E EC 34 C3 6F BF 6D BF 36 BF 89 A0 58 90 85 88 87 88 DF 88 18 A0 1A AF D1 B2 D0 B2 8A B2 08 80 9D C1 9A C1 C1 C1 4C C4 3B EB 1B F3 2D DE F5 EE 42 E8 60 E9 DB C3 9A C3 86 C3 A9 EC 00 EA 12 EB 5B E4 03 C6 7A E9 53 F1 60 DC 91 EC 04 EA 1B EB 1A E4 0E C6 7F E9 51 F1 58 DC 81 EC 0F EA 1F EB 12 E4 02 C6 5F E9 40 F1 61 DC B8 EC 08 EA 1A EB 36 E4 31 C6 74 E9 52 F1 4C DC 81 EC 40 65 08 65 1E 65 A8 4F 95 57 FA 7A 2F 4A 9D 4C 82 4D A2 42 D6 60 A8 4F 8F 57 BA 7A 28 4A 9D 4C 84 4D 9D 42 9A 60 E4 4F CE 57 F7 7A 66 4A 9E 4C 84 4D 82 42 97 60 FE 4F 8F 57 F5 7A 66 4A 88 4C 88 4D 9A 42 98 60 ED 4F 8F 57 F1 7A 35 4A 9B 4C 88 4D 82 42 A6 60 85 30 80 30 DA 30 28 1A 0E 02 71 2F B0 1F 08 19 1D 08 17 08 7D 08 66 27 EB 21 FC 20 F2 2F E8 0D 81 22 A1 3A 86 17 53 27 DC 21 FB BA F2 BA 9A BA 3A BF 5C 90 70 88 41 A5 94 95 16 93 20 92 22 9D 1A BF 07 A4 04 A4 65 A4 A1 96 95 BB 52 8B BE F2 B6 F2 DD F2 23 D5 36 F7 13 D8 24 C0 1B ED D1 DD 6A DB 46 DA 34 75 24 75 50 75 57 5A ED 5C F7 5D EF 52 ED 70 92 5F B5 47 A1 6A 5E 5A E2 5C EC 5D DC 52 FB 70 9D 5F B7 47 B0 6A A6 34 A0 34 C3 34 04 2B C1 1B 4B 1D 25 1C 66 13 5F 31 5A A5 5D A5 3C A5 E4 8F D4 97 D9 BA 72 8A 9A 8C 9F 8D B9 82 8F ED 83 ED E8 ED 16 DF 3A F2 DE C2 1B C4 47 C5 4D CA 5B E8 26 C7 14 DF 29 F2 E6 C2 65 C4 DB A2 D7 A2 B3 A2 60 BD 94 8D 00 8B 1F 8A 11 85 08 A7 7E 88 5D 90 7B BD B1 8D 14 8B 3B 8A CF 5A 9D 5A A6 5A 68 72 57 7D 70 5F 37 70 11 68 12 45 FB 75 44 73 6B 72 54 7D 48 5F 0E 70 17 68 2A 45 C0 75 45 73 50 72 68 7D 49 5F 34 70 29 68 2B 45 FD 75 7C 73 52 72 59 7D 70 5F 37 70 16 68 2A 45 C0 75 2C 73 36 72 35 7D 2B 5F 0E 70 77 68 58 45 C0 75 10 73 0C 72 0E 7D 11 5F 57 70 29 68 7F 45 AC 75 0D 73 0B 72 2C 7D 22 C0 33 C0 48 C0 BE F2 82 DF 4A EF FD E9 E2 E8 E9 E7 F7 C5 84 EA B8 F2 99 DF 4A EF F6 E9 CE E8 AC E7 D5 C5 B9 EA 98 F2 47 D1 55 D1 2C D1 D3 F8 8E F9 8C F6 83 D4 EE FB CD E3 FF CE 22 FE DD F8 98 F9 8C F6 85 D4 E3 FB C1 E3 F5 CE 61 FE A5 F8 AE F9 74 D5 61 D5 18 D5 E0 FC AB FD BF F2 B6 D0 D0 FF F2 E7 C6 CA 52 FA A9 FC B7 FD B3 F2 B6 D0 C8 FF FE E7 D3 CA 52 FA BC FC B6 FD A8 F2 B0 D0 F9 FF 79 DA 6E DA 14 DA DE C5 0B F5 AC F3 A4 F2 84 FD EF DF D6 F0 E4 E8 E2 C5 5F F5 A2 F3 B7 F2 BE FD BD DF D4 F0 FB E8 EC C5 5F F5 AB F3 A0 F2 A5 FD A0 DF FF F0 55 BF 10 BF 3B BF A8 A0 62 90 D1 96 9D 97 8E 98 92 BA F4 95 D4 8D D4 A0 73 90 AB 96 B6 97 BA 98 C3 BA EF 95 DF 8D EC A0 3E 90 86 96 93 97 A8 98 CB BA BD 95 C8 8D EE A0 73 90 9D 96 9D 97 96 98 8E BA F4 95 D1 8D D2 A0 73 90 9B 96 97 97 B5 98 C0 95 CC 95 AF 95 B4 BA 1F BC 0A BD 0F B2 18 90 69 BF 62 A7 66 8A A3 BA 17 BC 04 BD 3A B2) */;

	private static readonly object Ⴀ;

	private static readonly Array Ⴜ = new char[1840]
	{
		'\udc2e', '\udc22', '\udc2e', '\ud9d3', '\uf6db', '\ueeb8', '쎎', '\uf36b', '\uf5e6', '\uf4e6',
		'ﯴ', '\ud9ec', '\uf689', '\ueeb1', '쎩', '팛', '팓', '팚', '𥉉', 'ﯘ',
		'\uf4c0', '훂', '戀', '\ue1d4', '첗', 'ﱙ', '旼', '旸', '旾', '䴓',
		'䈑', '怤', '佽', '\udd41', '\udd46', '\udd42', '\uf264', '\uf4db', '\uf5d0', '𢡊',
		'\ud8a4', '\uf7dd', '\uefea', '\u2fd8', '\u2fd9', '\u2fdc', '⩔', '줞', '줐', '줛',
		'\ueede', '쳇', '\ue3bf', 'ﮂ', '횤', '\ue67d', '\ue0d0', '\ue1cb', '\ueef5', '쳐',
		'\ue392', 'ﮅ', '횯', '\ue64b', '䟺', '䟨', '䟼', '用', '塂', '梐',
		'渡', '漴', '恴', '䈠', '浞', '畴', '塭', '梏', '渳', '漲',
		'怷', '䈣', '浀', '畅', '堎', '\uf228', '\uf221', '\uf22f', '\udaf6', '헴',
		'\uf7fb', '\ud893', '삒', '\ued8b', '\udd41', '\udbfa', '\udad6', '⏱', '⏰', '⏹',
		'ᅅ', '齔', '齜', '齝', '뢟', '骊', '뗿', '귚', '胃', '뀫',
		'뚚', '랺', '뒆', '뒖', '뒌', '鯥', '鵔', '鱈', '鍉', '녳',
		'鸷', '蘍', 'ꬶ', '鯵', '鵾', '鱟', '鍆', '녕', '鸧', '蘅',
		'ꬑ', '\uea50', '\uea5e', '\uea5b', '\uf5e1', '씾', '쎉', '슜', '춽', '\uef9f',
		'샬', '\ud8fc', '\uf5f0', '씸', '쎏', '슔', '춒', '\uefa5', '₩', '₫',
		'₥', '\u085c', '\u0743', '瘷', '瘳', '瘺', '凨', '珤', '岍', '䒞',
		'쉲', '쉵', '쉼', '\uebbc', '\ueab1', '\ue5b9', '잩', '\ue8d7', '\uf0f2', '\udde5',
		'ⴺ', 'ⴵ', 'ⴵ', '㊚', 'ɒ', 'ӥ', '\u05fa', 'ૹ', '⣣', 'ޱ',
		'\u1ff5', '㊜', 'ə', 'Ӵ', 'ף', '\u0afb', '⣼', 'ޡ', '歉', '歎',
		'歙', '䇤', '姂', '瓲', '䐂', '䊗', '䎊', '䲥', '谒', '调',
		'调', 'ꗌ', 'ꓚ', 'ꯙ', '觊', '\ua6fa', '뺘', '鎢', 'ꍻ', 'ꗅ',
		'꒟', 'ꯎ', '觋', '\ua6fa', '뺙', '鎨', 'ꍵ', 'ꗪ', 'റ', '\u0d3b',
		'ണ', '\u08e3', '➐', '㾲', 'ኄ', '≡', '⒫', '◱', '⫶', '\u08ec',
		'➪', '콖', '콑', '콅', '\ue782', '\ue88b', '쪱', '\ue5f3', '\ufdd0', '탩',
		'\ue003', '၀', '။', 'ၔ', 'ᖒ', '㫭', '⋛', '\u0fe7', '㼳', '㦸',
		'㣍', '㞃', 'ᖟ', '㫣', '⋼', '穋', '穀', '穞', '䣊', '旨',
		'唢', '原', '劍', '嶋', '羨', '僮', '䣍', '旴', '唞', '㊹',
		'㊱', '㊯', 'ᕲ', '㝿', '᠄', '\u0012', 'ⴀ', '\u1dd6', '᭨', 'ᩇ',
		'蟐', '蟖', '蟇', '꼟', 'ꀺ', '舋', '굱', '땔', '顗', 'ཕ',
		'ན', 'ཌྷ', '⚊', '➍', '⢊', 'ઊ', '◳', '㷯', '\u001b', '\u001f',
		'\u0002', '⣔', '⟶', '׃', '⪚', '\uf2c3', '\uf2c0', '\uf2d9', '\uf736', '\ud844',
		'쁪', '\u0ae2', '૦', 'ૹ', '⁏', '㡠', 'ᕗ', '▪', '떩', '떪',
		'떵', 'ꨄ', '髛', '鱐', '랯', '램', '랲', '鴞', '蔲', 'ꠏ',
		'飇', '鹠', '齭', '遂', '\udd85', '\udd8e', '\udd9b', '숿', '\uf2ec', '\uf456',
		'\uf55c', '煮', '\ud856', '\uf71e', '\uef06', '숣', '\uf2f1', '\uf47e', '嶣', '嶤',
		'嶼', '眎', '漢', '䈘', '狿', '瑬', '畺', '穄', '姎', '妍',
		'姮', '䘴', '皦', '瀛', '焊', '縓', '尖', '獣', '歕', '䙢',
		'皭', '灔', '焗', '縎', '尝', '獫', '歌', '䙵', '皫', '灔',
		'焻', '縤', '屘', '獡', '歏', '䙳', '皼', '瀀', '焆', '縓',
		'屘', '獴', '歎', '䙨', '皺', '瀱', '⤫', '⤯', '⤊', 'و',
		'õ', 'ǩ', '\u0ec8', '쟗', '쟝', '쟵', '\ue01a', '숎', '\ued73', '\uf54a',
		'\ud866', '\ue8a5', '\uee19', '\uef15', '\ue009', '숒', 'ᾣ', 'ᾧ', 'ᾀ', 'ᨵ',
		'㔲', 'ⴘ', '4', '\u0f39', '༽', '༝', '◑', '㶵', '\u1082', '\u2073',
		'坤', '坣', '坁', '烪', '劫', '緘', '日', '䣅', '砍', '纝',
		'疃', '疄', '疥', '尙', '嵋', '剃', '灚', '弑', '䜝', '樔',
		'⑱', '⑴', '\u2456', '෫', 'ಹ', 'β', '↦', '\u0ef7', '嫢', '嫯',
		'嫊', '獸', '爪', '紸', '張', '灞', '桞', '䕄', '疁', '猬',
		'爻', '紣', '弤', '灹', '梦', '梪', '梏', '䀫', '佼', '浾',
		'䈁', '娊', '眀', '䟅', '䅨', '䁿', '佧', '浠', '䈽', '鰲',
		'鰶', '鰘', '뮼', '駗', '뚵', '꺘', 'ㇳ', 'ㇼ', '㇘', 'ᠰ',
		'\u192c', 'ᘩ', '㐫', '\u1b4e', 'ͳ', '\u2e64', 'ổ', 'ᠻ', '\u193b', 'ᘩ',
		'㐱', '᭔', '\u036c', '\u2e74', '\u20ef', '\u20e0', '\u20c3', '㽞', '\u0f87', '\u093a',
		'࠸', 'ݡ', '┈', '\u0a64', 'ሠ', '㽉', 'ྌ', 'ड', '࠶', 'ܮ',
		'┩', 'ੴ', '\uf027', '\uf06e', '\uf00a', 'ퟭ', '\uf5fd', '\uda8a', '슡', '\uef95',
		'\udf01', '\ud9e9', '\ud8e4', 'ퟬ', '\uf5fc', '\uda82', '슧', '\uef90', '\udf01', '\ud9f3',
		'\ud8e3', '\ud7a9', '\uf5c0', '\udaac', '싨', '\uef9b', '\udf55', '\ud9f4', '\ud8fd', '\ud7a9',
		'\uf5e5', '\uda80', '슸', '\uef80', '\udf01', '\ud9ef', '\ud8ef', 'ퟤ', '\uf5fc', '\uda86',
		'슣', '\uef80', '\udf01', '\ud9f3', '\ud8e5', '\ud7c7', '麬', '麺', '麂', '똮',
		'률', '魾', '둋', '갮', '脗', '뇉', '뜸', '뙻', '륰', '魫',
		'둊', '갴', '脏', '뇝', '뜹', '똮', '뤸', '魪', '됐', '갷',
		'脐', 'ᾊ', 'ᾜ', 'ᾥ', '㘟', '㝊', '㡋', '\u1a5f', '㕬', 'ⴍ',
		'*', 'ポ', '㙝', '㝆', '㡬', 'ᨒ', '㔵', 'ⴒ', ')', 'ィ',
		'㘟', '㜝', '㡔', 'ᩈ', '㔶', 'ⴍ', '\ue57c', '\ue574', '\ue54c', 'ퟜ',
		'\ufaeb', '쨳', '쳨', '춣', '슷', '\ue0b9', '쿡', '\udeb9', '\udeb2', '\ude88',
		'\uf19f', '\uf739', '\uf666', '沈', '\udb7b', '\uf41d', '\uec3f', '섫', '\uf19f', '\uf75b',
		'\uf650', 'ꃢ', 'ꃣ', 'ꃐ', 'ꕞ', 'ﮥ', 'ﮤ', 'ﮖ', '품', '얰',
		'얨', '얄', '\uef58', '\uf765', '\uda0b', '\ueac2', '\uec2a', '\ued69', '\ue27b', '쁵',
		'\uef58', '\uf72d', '\uda01', '\ueac2', '\uec66', '\ued74', '\ue278', '쀦', '\uef1d', '\uf73c',
		'\uda0a', '\ueac3', '\uec65', '\ued73', '\ue270', '쁇', '\udef6', '\udefa', '\udec3', '\uec7c',
		'셆', '\uf19f', '\uf702', '\uf67b', '浪', '\udb25', '\uf44a', '\uec6d', '셍', '\uf180',
		'\uf71f', '膒', '膐', '膤', 'ꡙ', 'ꥼ', '懤', '懧', '懓', '䘩',
		'搽', '䭪', 'ꁢ', 'ꁤ', 'ꁚ', '袽', '螩', 'ꖠ', '諆', '鋤',
		'뿰', '\ude2a', '\ude39', '\ude13', '\udbf9', '\uf490', '\ueca0', '솖', '\uf10c', '\uf7e3',
		'\uf6e2', '泥', '\udbfd', '\uf491', '\uecb6', '솛', '\uf141', '\uf7b0', '\uf6f5', '匿',
		'\udbee', '\uf490', '\uec80', '췭', '춲', '췗', '\ue56e', '\uea3a', '젩', '\ue751',
		'ｧ', '퉋', '\ue2cb', '\ue433', '\ue52e', '\uea22', '졻', '\ue751', '｡', '퉜',
		'\ue299', '\ue425', '\ue52f', '\uea20', '졻', '\ue740', 'ｱ', '퉘', '\ue28e', '\ue43b',
		'\ue510', '\uea63', '졻', '\ue70b', 'ｬ', '퉖', '\ue282', '\ue423', '\ue521', '\uea27',
		'젲', '\ue749', '｣', '퉏', '\ue2cb', '\ue424', '\ue533', '\uea22', '젫', '\ue705',
		'ｶ', '퉖', '\ue285', '\ue477', '\ue533', '\uea26', '젴', '\ue741', 'Ｂ', '퉋',
		'\ue28e', '\ue423', '\ue52c', '\uea2a', '젽', '\ue705', 'ｧ', '퉑', '\ue2bf', '⾾',
		'⾮', '⾅', '』', 'ß', '٥', 'ݠ', 'ࡣ', '⩭', 'ԛ', 'ᵱ',
		'』', 'Û', '٪', 'ݦ', 'ࡿ', '⩦', 'Ԙ', 'ᴐ', '홚', '화',
		'홦', '\ue49b', '짪', '魯', 'ﾄ', 'ﺖ', '\uf19b', '펀', 'ﲲ', '\ue4c6',
		'짢', '擄', 'ﾁ', 'ﺔ', '\uf1d4', '㴘', '㴔', '㴥', '⊾', 'ቻ',
		'ᓉ', 'ᗖ', '\u1adf', '㣾', 'អ', '\u0f92', '⊸', 'ቲ', 'ᓋ', 'ᗳ',
		'㱿', '㱬', '㱁', 'ᖷ', 'ᒷ', '\u1ba6', '㦬', 'ᛞ', 'ໆ', '⎋',
		'ጋ', 'ᖠ', 'ᒦ', 'ᮽ', '㦠', 'ᛱ', 'ະ', '⏖', 'ጠ', 'ᖀ',
		'ᒙ', '\u1baa', '汁', '汈', '汾', '䛽', '廝', '珺', '䌯', '䖗',
		'䒍', '䮌', '榘', '䛥', '쇍', '쇂', '속', '\ue611', '쐜', '\ueb48',
		'\uf348', '\ude7b', '\uee84', '\ue803', '\ue90e', '\ue606', '쐒', '\ueb69', '\uf361', '\ude7a',
		'\ueeb9', '\ue836', '囤', '囡', '嚥', '焙', '匇', '簁', '摥', '䥕',
		'邃', '邋', '郁', '뾬', '륍', '롍', '띈', '镙', '먮', 'ꈟ',
		'轿', '\uf77d', '\uf762', '\uf73e', '엦', '\ue8c8', '\ud81f', '\udee9', '\udfb4', '킼',
		'\uf2a6', '\uddea', '엦', '\ue8de', '\ud824', '\udebe', '\udfa4', '킰', '\uf297', '\uddc5',
		'엧', '\ue8dd', '\ud81e', '\ude94', '\udfa4', '킽', '\uf2ae', '\udddc', '엾', '\ue8ea',
		'\ud827', '\udea0', '\udfb6', '킐', '\uf297', '깟', '깎', '긛', '蛒', '覔',
		'ꮁ', '蓴', '鳑', '뇨', '腹', '螖', '蚗', '覒', 'ꮇ', '蓾',
		'鳆', '뇤', '脫', '螵', '蛒', 'ꋏ', 'ꋁ', 'ꊊ', '謐', '訊',
		'蔂', 'ꜘ', '衄', '道', '뵾', '趪', '講', '訋', '蔗', '\ua716',
		'衵', '遰', 'ḁ', 'ḃ', 'ṇ', 'ᯢ', '㒌', 'Ꮶ', 'Ꮳ', 'Ꭱ',
		'ᘩ', '㥂', 'ⅹ', '\u0c42', '㲡', 'ᚐ', '᚛', 'ᛘ', '␍', 'ड',
		'㧢', '㽆', '㹔', 'ㅸ', 'ጆ', '㰬', '␖', 'ठ', '㧓', '\ue8be',
		'\ue8ae', '\ue8f7', '콢', '\ued6d', '숂', '\uda3d', '\uf703', '쟞', '설', '쁠',
		'콹', '\ued60', '숂', '\uda71', '\uf71e', '쟑', '셠', '쁖', '瑵', '瑻',
		'琿', '岪', '厾', '熷', '廑', '䛳', '毇', '孓', '嶻', '岴',
		'厮', '熢', '廛', '䛿', '毥', 'Ꞙ', '\ua715', 'ꟓ', '輕', '而',
		'ꉁ', '贤', '镗', '련', '裻', '蹅', '轛', '聗', 'ꉆ', '贳',
		'镗', '렿', '裿', '蹕', '輕', '聄', 'ꉋ', '账', '锅', '렩',
		'裍', '踂', '轁', '聓', 'ꉀ', '贼', '锒', '렘', '袾', '蹇',
		'轝', '聂', 'ꈎ', '贴', '错', '렭', '袾', '蹕', '轚', '聒',
		'ꉀ', '费', '销', '롬', '裻', '蹁', '轛', '聃', 'ꉁ', '贾',
		'错', '렍', '袾', '蹐', '轚', '聐', 'ꈎ', '财', '锒', '렸',
		'裲', '蹋', '轓', '耖', 'ꉚ', '贼', '锂', '렭', '裸', '蹇',
		'轑', '耖', 'ꉋ', '贸', '锣', '\ude18', '\ude11', '\ude54', '\uec83', '솭',
		'\uf17a', '\uf78c', '\uf6db', '履', '\udbc9', '\uf4bf', '\uecbb', 'Ç', 'L', '\u008a',
		'⾽', '⥝', '⡊', '❉', 'Ց', '⨯', '㈈', 'ἳ', '\u2fe1', '⥝',
		'⡊', '❉', 'Ց', '⨯', '㈈', 'ἳ', '⾳', '⤘', '⠜', '✛',
		'Ԕ', '⩜', '㈈', 'ὧ', '⾤', '⤓', '⠆', '✌', 'ԥ', '⨯',
		'㉜', 'ώ', '⾤', '⤔', '⠆', '✪', 'Ց', '⩽', '㉍', 'ὧ',
		'⾲', '⤈', '⠆', '✪', '՜', '⩝', '㉩', 'ἳ', '⾤', '⤕',
		'⠞', '❉', 'Ԟ', '⩻', '㈈', 'ὶ', '⾬', '⤒', '⠉', '✅',
		'Ԕ', '⩘', '㈈', 'ἳ', '\u2fe1', '⥝', '⡊', '❉', 'Ց', '⨯',
		'㈈', 'ἳ', '\u2fe1', '⥝', '⠖', '曢', '晩', '暬', '丳', '䅬',
		'捴', '䰊', '吭', '礖', '䧄', '佸', '乯', '䅬', '捴', '䰊',
		'吭', '礖', '䧄', '佸', '乯', '䅬', '捴', '䰊', '吭', '礖',
		'䧄', '佸', '乯', '䅬', '捴', '䰊', '吭', '礖', '䧄', '佢',
		'主', '䄭', '捴', '䱄', '呢', '祟', '䦐', '伹', '丢', '䄾',
		'挻', '䱌', '呣', '祟', '䧄', '伪', '个', '䄸', '挸', '䱃',
		'呋', '礖', '䧄', '佸', '乯', '䅬', '捴', '䰊', '吭', '礖',
		'䧄', '佸', '乯', '䅬', '捴', '䰊', '吭', '礖', '䧄', '佸',
		'乯', '䅬', '挨', 'Ἤ', 'ᾧ', 'ὣ', '\u1ae6', '㗄', '\u2de3', 'Ø',
		'《', '㚶', '㞡', '㢢', '\u1aba', '㗄', '\u2de3', 'Ø', 'ぅ', '㛣',
		'㟙', '㣩', '᪪', '㗖', 'ⶩ', 'Í', 'せ', '㛢', '㞶', '㢿',
		'\u1aec', '㗛', 'ⶫ', '\u009b', 'ぞ', '㛷', '㟶', '㢭', '\u1af7', '㖋',
		'ⶠ', 'Ö', 'く', '㛴', '㟴', '㣶', '\u1aef', '㖋', 'ⶺ', 'Ö',
		'そ', '㛡', '㟶', '㢭', '\u1ab5', '㗞', 'ⶳ', '\u008c', 'ぞ', '㛾',
		'㞡', '㢢', '᪠', '㖐', 'ⶢ', 'Ø', 'ぅ', '㛻', '㟤', '㣆',
		'\u1aba', '㗄', '\u2de3', 'Ø', '《', '㚶', '㞡', '㢢', '\u1aba', '㗄',
		'\u2dbf', '慭', '愰', '愽', '擵', '䯋', '句', '绐', '丘', '䢻',
		'䦬', '䚢', '撸', '䮅', '叭', '绐', '丏', '䢶', '䦲', '䛣',
		'撩', '䯐', '叧', '绍', '上', '䢺', '䦡', '䛣', '撩', '䯐',
		'叭', '绀', '之', '䢥', '䦥', '䚷', '撵', '䯀', '厢', '络',
		'丘', '䢶', '䦥', '䚯', '撫', '䮅', '叶', '绉', '丆', '䢸',
		'䦲', '䚳', '擻', '䯋', '叫', '绞', '丄', '䢻', '䧠', '䚦',
		'撳', '䯑', '厢', '绍', '个', '팺', '팺', '퍫', '╤', '◠',
		'┶', 'ය', 'ʾ', '₽', '\u0fdc', '៸', '㪐', 'ਐ', '\u0cbb', 'ඤ',
		'ʧ', '₻', '࿇', '៸', '㪐', 'ਛ', 'ಪ', 'ච', 'ʦ', '₳',
		'࿙', '\u17fa', '㪐', 'ਊ', 'ಹ', 'ච', 'ʢ', '\u20f2', '\u0fdf', '\u17ee',
		'㫄', '\u0a03', 'ಬ', 'ඬ', 'ʤ', '₷', '\u0feb', 'ឫ', '㪎', '\u0a4f',
		'\u0cfe', '෩', '\u02ea', '\u20f2', 'ྌ', 'ឫ', '㪐', '\u0a53', 'ೠ', 'ඬ',
		'ʿ', '₣', '࿅', '៥', '㫥', '\u0a42', 'ಬ', 'ඬ', 'ʾ', '₾',
		'࿅', '\u17cd', '㪐', 'ਚ', 'ಚ', '෩', 'ʾ', '₷', '\u0fff', '훮',
		'횽', '횽', '퍸', 'ﱔ', '\ue464', '쥌', '連', 'Ｑ', '︰', '\uf160',
		'팬', 'ﱃ', '\ue46f', '쥖', '轢', '＠', '﹣', '\uf134', '팶', 'ﱃ',
		'\ue468', '쥖', '嶺', 'ｴ', '︱', '\uf125', '팬', 'ﱕ', '\ue474', '쥖',
		'嶺', 'ｹ', '︑', '\uf101', '퍸', 'ﱉ', '\ue475', '줚', '歷', 'Ｑ',
		'︷', '\uf123', '팽', 'ﱈ', '\ue46f', '쥕', '曆', 'ｴ', '︰', '\uf132',
		'팽', 'ﱕ', '\ue454', 'ᛍ', 'ᛎ', 'ᚙ', '␂', 'ह', '㧫', '\ue1de',
		'\ue1d7', '\ue18b', '줖', '옘', '\ue40b', '쭷', '퍲', '﹡', '캴', '젅',
		'줧', '韱', '韨', '鞧', 'ꕪ', '衄', '뢓', '빥', '뼿', '뀼',
		'鈿', '뵽', 'ꕂ', '衕', '뢂', '븿', '뼹', '뀌', '鈳', '뵗',
		'ꕻ', '行', '뢛', '븈', '뼀', '뀸', '鈡', '뵺', 'ꕂ', '竖',
		'竞', '突', '崋', '缅', '偺', '䡌', '敮', '喳', '匂', '刲',
		'ꞗ', 'Ꞟ', '\ua7cf', '렦', '裹', '蹎', '轛', '聺', 'ꉂ', '贼',
		'销', '렇', '旴', '旮', '断', '䴭', '䈻', '怦', '伒', '坵',
		'穉', '䪕', '䰡', '䴕', '䈆', '怬', '何', '坼', '穏', '䪾',
		'䰺', '䴷', '䈿', '怫', '佐', '坘', '穼', '䪕', '䰨', '䴚',
		'䈆', '缿', '缵', '罥', '喊', '䶜', '悧', '偸', '囆', '埀',
		'壔', '竚', '喢', '䶫', 'ㄍ', 'ㄝ', 'ㅖ', '᧘', 'ᛆ', '㓟',
		'\u1bab', 'Ϋ', '\u2ef9', 'ṳ', 'ᣂ', '\u19cc', 'ᛥ', '㒛', '᮷', '\u0383',
		'⺵', 'Ṥ', 'ᣤ', '襵', '襲', '褩', 'ꘋ', 'ꂪ', 'ꆼ', '꺵',
		'貊', 'ꎝ', '믛', '䗅', '䗈', '䖘', '檦', '氏', '洝', '戯',
		'䁓', '潠', '睃', '婺', '檐', '江', '洜', '戄', '䀽', '世',
		'丈', '么', '冞', '慣', '柏', '曒', '槌', '䯅', '撰', '粖',
		'冪', '慀', '柰', '曈', '槝', '䯌', '撷', '粿', '冴', '慱',
		'査', '曏', '槖', '䯅', '撷', '粕', '冁', '慌', '柋', '曝',
		'槻', '䯼', '\u1dca', '\u1dcc', 'ᶕ', '⽉', 'ɲ', '㊭', '㐳', '㔞',
		'㨩', 'Ⱘ', 'Ⱖ', 'ⱈ', 'ۀ', 'Ả', '㎔', '\u034d', '׳', 'Ӧ',
		'\u0ba6', '⧭', 'څ', 'ẳ', '㎝', '\u035a', '\u05c1', 'ҥ', '⿲', '⿹',
		'⾓', 'ぃ', '\u009c', 'ث', '\u073e', '\u081f', '⨷', '՟', 'ᵩ', 'ぇ',
		'\u0080', '؛', '瀤', '瀥', '灆', '垥', '쨉', '쨜', '쩪', '\uedd4',
		'쿋', '\ue0ae', '\uf896', '햎', '\ue52f', '\ue3d4', '\ue2ca', '\uedce', '쿋', '\ue0a0',
		'\uf888', '햴', '\ue568', '\ue3da', '\ue2d6', '\uede8', '쾟', '\ue080', '\uf8b5', '했'
	};

	private static readonly object ႤႥ;

	internal static ႤႤ ႤႷ/* Not supported: data(2E DC 22 DC 2E DC D3 D9 DB F6 B8 EE 8E C3 6B F3 E6 F5 E6 F4 F4 FB EC D9 89 F6 B1 EE A9 C3 1B D3 13 D3 1A D3 D5 FA D8 FB C0 F4 C2 D6 90 F9 D4 E1 97 CC 59 FC FC 65 F8 65 FE 65 13 4D 11 42 24 60 7D 4F 41 DD 46 DD 42 DD 64 F2 DB F4 D0 F5 CF FA A4 D8 DD F7 EA EF D8 2F D9 2F DC 2F 54 2A 1E C9 10 C9 1B C9 DE EE C7 CC BF E3 82 FB A4 D6 7D E6 D0 E0 CB E1 F5 EE D0 CC 92 E3 85 FB AF D6 4B E6 FA 47 E8 47 FC 47 28 75 42 58 90 68 21 6E 34 6F 74 60 20 42 5E 6D 74 75 6D 58 8F 68 33 6E 32 6F 37 60 23 42 40 6D 45 75 0E 58 28 F2 21 F2 2F F2 F6 DA F4 D5 FB F7 93 D8 92 C0 8B ED 41 DD FA DB D6 DA F1 23 F0 23 F9 23 45 11 54 9F 5C 9F 5D 9F 9F B8 8A 9A FF B5 DA AD C3 80 2B B0 9A B6 BA B7 86 B4 96 B4 8C B4 E5 9B 54 9D 48 9C 49 93 73 B1 37 9E 0D 86 36 AB F5 9B 7E 9D 5F 9C 46 93 55 B1 27 9E 05 86 11 AB 50 EA 5E EA 5B EA E1 F5 3E C5 89 C3 9C C2 BD CD 9F EF EC C0 FC D8 F0 F5 38 C5 8F C3 94 C2 92 CD A5 EF A9 20 AB 20 A5 20 5C 08 43 07 37 76 33 76 3A 76 E8 51 E4 73 8D 5C 9E 44 72 C2 75 C2 7C C2 BC EB B1 EA B9 E5 A9 C7 D7 E8 F2 F0 E5 DD 3A 2D 35 2D 35 2D 9A 32 52 02 E5 04 FA 05 F9 0A E3 28 B1 07 F5 1F 9C 32 59 02 F4 04 E3 05 FB 0A FC 28 A1 07 49 6B 4E 6B 59 6B E4 41 C2 59 F2 74 02 44 97 42 8A 43 A5 4C 12 8C 03 8C 03 8C CC A5 DA A4 D9 AB CA 89 FA A6 98 BE A2 93 7B A3 C5 A5 9F A4 CE AB CB 89 FA A6 99 BE A8 93 75 A3 EA A5 31 0D 3B 0D 23 0D E3 08 90 27 B2 3F 84 12 61 22 AB 24 F1 25 F6 2A EC 08 AA 27 56 CF 51 CF 45 CF 82 E7 8B E8 B1 CA F3 E5 D0 FD E9 D0 03 E0 40 10 4B 10 54 10 92 15 ED 3A DB 22 E7 0F 33 3F B8 39 CD 38 83 37 9F 15 E3 3A FC 22 4B 7A 40 7A 5E 7A CA 48 E8 65 22 55 9F 53 8D 52 8B 5D A8 7F EE 50 CD 48 F4 65 1E 55 B9 32 B1 32 AF 32 72 15 7F 37 04 18 12 00 00 2D D6 1D 68 1B 47 1A D0 87 D6 87 C7 87 1F AF 3A A0 0B 82 71 AD 54 B5 57 98 55 0F 53 0F 4D 0F 8A 26 8D 27 8A 28 8A 0A F3 25 EF 3D 1B 00 1F 00 02 00 D4 28 F6 27 C3 05 9A 2A C3 F2 C0 F2 D9 F2 36 F7 44 D8 6A C0 E2 0A E6 0A F9 0A 4F 20 60 38 57 15 AA 25 A9 B5 AA B5 B5 B5 04 AA DB 9A 50 9C AF B7 A8 B7 B2 B7 1E 9D 32 85 0F A8 C7 98 60 9E 6D 9F 42 90 85 DD 8E DD 9B DD 3F C2 EC F2 56 F4 5C F5 48 FA 56 D8 1E F7 06 EF 23 C2 F1 F2 7E F4 A3 5D A4 5D BC 5D 0E 77 22 6F 18 42 FF 72 6C 74 7A 75 44 7A CE 59 8D 59 EE 59 34 46 A6 76 1B 70 0A 71 13 7E 16 5C 63 73 55 6B 62 46 AD 76 54 70 17 71 0E 7E 1D 5C 6B 73 4C 6B 75 46 AB 76 54 70 3B 71 24 7E 58 5C 61 73 4F 6B 73 46 BC 76 00 70 06 71 13 7E 58 5C 74 73 4E 6B 68 46 BA 76 31 70 2B 29 2F 29 0A 29 48 06 F5 00 E9 01 C8 0E D7 C7 DD C7 F5 C7 1A E0 0E C2 73 ED 4A F5 66 D8 A5 E8 19 EE 15 EF 09 E0 12 C2 A3 1F A7 1F 80 1F 35 1A 32 35 18 2D 34 00 39 0F 3D 0F 1D 0F D1 25 B5 3D 82 10 73 20 64 57 63 57 41 57 EA 70 AB 52 D8 7D E5 65 C5 48 0D 78 9D 7E 83 75 84 75 A5 75 19 5C 4B 5D 43 52 5A 70 11 5F 1D 47 14 6A 71 24 74 24 56 24 EB 0D B9 0C B2 03 A6 21 F7 0E E2 5A EF 5A CA 5A 78 73 2A 72 38 7D 35 5F 5E 70 5E 68 44 45 81 75 2C 73 3B 72 23 7D 24 5F 79 70 A6 68 AA 68 8F 68 2B 40 7C 4F 7E 6D 01 42 0A 5A 00 77 C5 47 68 41 7F 40 67 4F 60 6D 3D 42 32 9C 36 9C 18 9C BC BB D7 99 B5 B6 98 AE F3 31 FC 31 D8 31 30 18 2C 19 29 16 2B 34 4E 1B 73 03 64 2E D5 1E 3B 18 3B 19 29 16 31 34 54 1B 6C 03 74 2E EF 20 E0 20 C3 20 5E 3F 87 0F 3A 09 38 08 61 07 08 25 64 0A 20 12 49 3F 8C 0F 21 09 36 08 2E 07 29 25 74 0A 27 F0 6E F0 0A F0 ED D7 FD F5 8A DA A1 C2 95 EF 01 DF E9 D9 E4 D8 EC D7 FC F5 82 DA A7 C2 90 EF 01 DF F3 D9 E3 D8 A9 D7 C0 F5 AC DA E8 C2 9B EF 55 DF F4 D9 FD D8 A9 D7 E5 F5 80 DA B8 C2 80 EF 01 DF EF D9 EF D8 E4 D7 FC F5 86 DA A3 C2 80 EF 01 DF F3 D9 E5 D8 C7 D7 AC 9E BA 9E 82 9E 2E B6 60 B9 7E 9B 4B B4 2E AC 17 81 C9 B1 38 B7 7B B6 70 B9 6B 9B 4A B4 34 AC 0F 81 DD B1 39 B7 2E B6 38 B9 6A 9B 10 B4 37 AC 10 81 8A 1F 9C 1F A5 1F 1F 36 4A 37 4B 38 5F 1A 6C 35 0D 2D 2A 00 DD 30 5D 36 46 37 6C 38 12 1A 35 35 12 2D 29 00 A3 30 1F 36 1D 37 54 38 48 1A 36 35 0D 2D 7C E5 74 E5 4C E5 DC D7 EB FA 33 CA E8 CC A3 CD B7 C2 B9 E0 E1 CF B9 DE B2 DE 88 DE 9F F1 39 F7 66 F6 72 F9 7B DB 1D F4 3F EC 2B C1 9F F1 5B F7 50 F6 E2 A0 E3 A0 D0 A0 5E A5 A5 FB A4 FB 96 FB 88 D4 B0 C5 A8 C5 84 C5 58 EF 65 F7 0B DA C2 EA 2A EC 69 ED 7B E2 75 C0 58 EF 2D F7 01 DA C2 EA 66 EC 74 ED 78 E2 26 C0 1D EF 3C F7 0A DA C3 EA 65 EC 73 ED 70 E2 47 C0 F6 DE FA DE C3 DE 7C EC 46 C1 9F F1 02 F7 7B F6 2A F9 25 DB 4A F4 6D EC 4D C1 80 F1 1F F7 92 81 90 81 A4 81 59 A8 7C A9 E4 61 E7 61 D3 61 29 46 3D 64 6A 4B 62 A0 64 A0 5A A0 BD 88 A9 87 A0 A5 C6 8A E4 92 F0 BF 2A DE 39 DE 13 DE F9 DB 90 F4 A0 EC 96 C1 0C F1 E3 F7 E2 F6 E3 F9 FD DB 91 F4 B6 EC 9B C1 41 F1 B0 F7 F5 F6 EB F9 EE DB 90 F4 80 EC ED CD B2 CD D7 CD 6E E5 3A EA 29 C8 51 E7 67 FF 4B D2 CB E2 33 E4 2E E5 22 EA 7B C8 51 E7 61 FF 5C D2 99 E2 25 E4 2F E5 20 EA 7B C8 40 E7 71 FF 58 D2 8E E2 3B E4 10 E5 63 EA 7B C8 0B E7 6C FF 56 D2 82 E2 23 E4 21 E5 27 EA 32 C8 49 E7 63 FF 4F D2 CB E2 24 E4 33 E5 22 EA 2B C8 05 E7 76 FF 56 D2 85 E2 77 E4 33 E5 26 EA 34 C8 41 E7 22 FF 4B D2 8E E2 23 E4 2C E5 2A EA 3D C8 05 E7 67 FF 51 D2 BF E2 BE 2F AE 2F 85 2F 0F 30 DF 00 65 06 60 07 63 08 6D 2A 1B 05 71 1D 0F 30 DB 00 6A 06 66 07 7F 08 66 2A 18 05 10 1D 5A D6 54 D6 66 D6 9B E4 EA C9 39 F9 84 FF 96 FE 9B F1 80 D3 B2 FC C6 E4 E2 C9 30 F9 81 FF 94 FE D4 F1 18 3D 14 3D 25 3D BE 22 7B 12 C9 14 D6 15 DF 1A FE 38 A2 17 92 0F B8 22 72 12 CB 14 F3 15 7F 3C 6C 3C 41 3C B7 15 B7 14 A6 1B AC 39 DE 16 C6 0E 8B 23 0B 13 A0 15 A6 14 BD 1B A0 39 F1 16 B0 0E D6 23 20 13 80 15 99 14 AA 1B 41 6C 48 6C 7E 6C FD 46 DD 5E FA 73 2F 43 97 45 8D 44 8C 4B 98 69 E5 46 CD C1 C2 C1 8D C1 11 E6 1C C4 48 EB 48 F3 7B DE 84 EE 03 E8 0E E9 06 E6 12 C4 69 EB 61 F3 7A DE B9 EE 36 E8 E4 56 E1 56 A5 56 19 71 07 53 01 7C 65 64 55 49 83 90 8B 90 C1 90 AC BF 4D B9 4D B8 48 B7 59 95 2E BA 1F A2 7F 8F 7D F7 62 F7 3E F7 E6 C5 C8 E8 1F D8 E9 DE B4 DF BC D0 A6 F2 EA DD E6 C5 DE E8 24 D8 BE DE A4 DF B0 D0 97 F2 C5 DD E7 C5 DD E8 1E D8 94 DE A4 DF BD D0 AE F2 DC DD FE C5 EA E8 27 D8 A0 DE B6 DF 90 D0 97 F2 5F AE 4E AE 1B AE D2 86 94 89 81 AB F4 84 D1 9C E8 B1 79 81 96 87 97 86 92 89 87 AB FE 84 C6 9C E4 B1 2B 81 B5 87 D2 86 CF A2 C1 A2 8A A2 10 8B 0A 8A 02 85 18 A7 44 88 53 90 7E BD AA 8D 1B 8B 0B 8A 17 85 16 A7 75 88 70 90 01 1E 03 1E 47 1E E2 1B 8C 34 E6 13 E3 13 A1 13 29 16 42 39 79 21 42 0C A1 3C 90 16 9B 16 D8 16 0D 24 21 09 E2 39 46 3F 54 3E 78 31 06 13 2C 3C 16 24 20 09 D3 39 BE E8 AE E8 F7 E8 62 CF 6D ED 02 C2 3D DA 03 F7 DE C7 24 C1 60 C0 79 CF 60 ED 02 C2 71 DA 1E F7 D1 C7 60 C1 56 C0 75 74 7B 74 3F 74 AA 5C BE 53 B7 71 D1 5E F3 46 C7 6B 53 5B BB 5D B4 5C AE 53 A2 71 DB 5E FF 46 E5 6B 98 A7 15 A7 D3 A7 15 8F 0C 80 41 A2 24 8D 57 95 28 B8 FB 88 45 8E 5B 8F 57 80 46 A2 33 8D 57 95 3F B8 FF 88 55 8E 15 8F 44 80 4B A2 26 8D 05 95 29 B8 CD 88 02 8E 41 8F 53 80 40 A2 3C 8D 12 95 18 B8 BE 88 47 8E 5D 8F 42 80 0E A2 34 8D 19 95 2D B8 BE 88 55 8E 5A 8F 52 80 40 A2 39 8D 00 95 6C B8 FB 88 41 8E 5B 8F 43 80 41 A2 3E 8D 19 95 0D B8 BE 88 50 8E 5A 8F 50 80 0E A2 22 8D 12 95 38 B8 F2 88 4B 8E 53 8F 16 80 5A A2 3C 8D 02 95 2D B8 F8 88 47 8E 51 8F 16 80 4B A2 38 8D 23 95 18 DE 11 DE 54 DE 83 EC AD C1 7A F1 8C F7 DB F6 DF F9 C9 DB BF F4 BB EC C7 00 4C 00 8A 00 BD 2F 5D 29 4A 28 49 27 51 05 2F 2A 08 32 33 1F E1 2F 5D 29 4A 28 49 27 51 05 2F 2A 08 32 33 1F B3 2F 18 29 1C 28 1B 27 14 05 5C 2A 08 32 67 1F A4 2F 13 29 06 28 0C 27 25 05 2F 2A 5C 32 7D 1F A4 2F 14 29 06 28 2A 27 51 05 7D 2A 4D 32 67 1F B2 2F 08 29 06 28 2A 27 5C 05 5D 2A 69 32 33 1F A4 2F 15 29 1E 28 49 27 1E 05 7B 2A 08 32 76 1F AC 2F 12 29 09 28 05 27 14 05 58 2A 08 32 33 1F E1 2F 5D 29 4A 28 49 27 51 05 2F 2A 08 32 33 1F E1 2F 5D 29 16 28 E2 66 69 66 AC 66 33 4E 6C 41 74 63 0A 4C 2D 54 16 79 C4 49 78 4F 6F 4E 6C 41 74 63 0A 4C 2D 54 16 79 C4 49 78 4F 6F 4E 6C 41 74 63 0A 4C 2D 54 16 79 C4 49 78 4F 6F 4E 6C 41 74 63 0A 4C 2D 54 16 79 C4 49 62 4F 3B 4E 2D 41 74 63 44 4C 62 54 5F 79 90 49 39 4F 22 4E 3E 41 3B 63 4C 4C 63 54 5F 79 C4 49 2A 4F 2A 4E 38 41 38 63 43 4C 4B 54 16 79 C4 49 78 4F 6F 4E 6C 41 74 63 0A 4C 2D 54 16 79 C4 49 78 4F 6F 4E 6C 41 74 63 0A 4C 2D 54 16 79 C4 49 78 4F 6F 4E 6C 41 28 63 2C 1F A7 1F 63 1F E6 1A C4 35 E3 2D D8 00 0A 30 B6 36 A1 37 A2 38 BA 1A C4 35 E3 2D D8 00 45 30 E3 36 D9 37 E9 38 AA 1A D6 35 A9 2D CD 00 5B 30 E2 36 B6 37 BF 38 EC 1A DB 35 AB 2D 9B 00 5E 30 F7 36 F6 37 AD 38 F7 1A 8B 35 A0 2D D6 00 4F 30 F4 36 F4 37 F6 38 EF 1A 8B 35 BA 2D D6 00 5D 30 E1 36 F6 37 AD 38 B5 1A DE 35 B3 2D 8C 00 5E 30 FE 36 A1 37 A2 38 A0 1A 90 35 A2 2D D8 00 45 30 FB 36 E4 37 C6 38 BA 1A C4 35 E3 2D D8 00 0A 30 B6 36 A1 37 A2 38 BA 1A C4 35 BF 2D 6D 61 30 61 3D 61 F5 64 CB 4B E5 53 D0 7E 18 4E BB 48 AC 49 A2 46 B8 64 85 4B ED 53 D0 7E 0F 4E B6 48 B2 49 E3 46 A9 64 D0 4B E7 53 CD 7E 0A 4E BA 48 A1 49 E3 46 A9 64 D0 4B ED 53 C0 7E 4B 4E A5 48 A5 49 B7 46 B5 64 C0 4B A2 53 DC 7E 18 4E B6 48 A5 49 AF 46 AB 64 85 4B F6 53 C9 7E 06 4E B8 48 B2 49 B3 46 FB 64 CB 4B EB 53 DE 7E 04 4E BB 48 E0 49 A6 46 B3 64 D1 4B A2 53 CD 7E 2A 4E 3A D3 3A D3 6B D3 64 25 E0 25 36 25 BA 0D BE 02 BD 20 DC 0F F8 17 90 3A 10 0A BB 0C A4 0D A7 02 BB 20 C7 0F F8 17 90 3A 1B 0A AA 0C A0 0D A6 02 B3 20 D9 0F FA 17 90 3A 0A 0A B9 0C A0 0D A2 02 F2 20 DF 0F EE 17 C4 3A 03 0A AC 0C AC 0D A4 02 B7 20 EB 0F AB 17 8E 3A 4F 0A FE 0C E9 0D EA 02 F2 20 8C 0F AB 17 90 3A 53 0A E0 0C AC 0D BF 02 A3 20 C5 0F E5 17 E5 3A 42 0A AC 0C AC 0D BE 02 BE 20 C5 0F CD 17 90 3A 1A 0A 9A 0C E9 0D BE 02 B7 20 FF 0F EE D6 BD D6 BD D6 78 D3 54 FC 64 E4 4C C9 9A F9 31 FF 30 FE 60 F1 2C D3 43 FC 6F E4 56 C9 8D F9 20 FF 63 FE 34 F1 36 D3 43 FC 68 E4 56 C9 AB F9 74 FF 31 FE 25 F1 2C D3 55 FC 74 E4 56 C9 AB F9 79 FF 11 FE 01 F1 78 D3 49 FC 75 E4 1A C9 8C F9 31 FF 37 FE 23 F1 3D D3 48 FC 6F E4 55 C9 8B F9 74 FF 30 FE 32 F1 3D D3 55 FC 54 E4 CD 16 CE 16 99 16 02 24 39 09 EB 39 DE E1 D7 E1 8B E1 16 C9 18 C6 0B E4 77 CB 72 D3 61 FE B4 CE 05 C8 27 C9 F1 97 E8 97 A7 97 6A A5 44 88 93 B8 65 BE 3F BF 3C B0 3F 92 7D BD 42 A5 55 88 82 B8 3F BE 39 BF 0C B0 33 92 57 BD 7B A5 4C 88 9B B8 08 BE 00 BF 38 B0 21 92 7A BD 42 A5 D6 7A DE 7A 81 7A 0B 5D 05 7F 7A 50 4C 48 6E 65 B3 55 02 53 32 52 97 A7 9E A7 CF A7 26 B8 F9 88 4E 8E 5B 8F 7A 80 42 A2 3C 8D 00 95 07 B8 F4 65 EE 65 AD 65 2D 4D 3B 42 26 60 12 4F 75 57 49 7A 95 4A 21 4C 15 4D 06 42 2C 60 55 4F 7C 57 4F 7A BE 4A 3A 4C 37 4D 3F 42 2B 60 50 4F 58 57 7C 7A 95 4A 28 4C 1A 4D 06 42 3F 7F 35 7F 65 7F 8A 55 9C 4D A7 60 78 50 C6 56 C0 57 D4 58 DA 7A A2 55 AB 4D 0D 31 1D 31 56 31 D8 19 C6 16 DF 34 AB 1B AB 03 F9 2E 73 1E C2 18 CC 19 E5 16 9B 34 B7 1B 83 03 B5 2E 64 1E E4 18 75 89 72 89 29 89 0B A6 AA A0 BC A1 B5 AE 8A 8C 9D A3 DB BB C5 45 C8 45 98 45 A6 6A 0F 6C 1D 6D 2F 62 53 40 60 6F 43 77 7A 5A 90 6A 5F 6C 1C 6D 04 62 3D 40 16 4E 08 4E 48 4E 9E 51 63 61 CF 67 D2 66 CC 69 C5 4B B0 64 96 7C AA 51 40 61 F0 67 C8 66 DD 69 CC 4B B7 64 BF 7C B4 51 71 61 FB 67 CF 66 D6 69 C5 4B B7 64 95 7C 81 51 4C 61 CB 67 DD 66 FB 69 FC 4B CA 1D CC 1D 95 1D 49 2F 72 02 AD 32 33 34 1E 35 29 3A 28 2C 26 2C 48 2C C0 06 A2 1E 94 33 4D 03 F3 05 E6 04 A6 0B ED 29 85 06 B3 1E 9D 33 5A 03 C1 05 A5 04 F2 2F F9 2F 93 2F 43 30 9C 00 2B 06 3E 07 1F 08 37 2A 5F 05 69 1D 47 30 80 00 1B 06 24 70 25 70 46 70 A5 57 09 CA 1C CA 6A CA D4 ED CB CF AE E0 96 F8 8E D5 2F E5 D4 E3 CA E2 CE ED CB CF A0 E0 88 F8 B4 D5 68 E5 DA E3 D6 E2 E8 ED 9F CF 80 E0 B5 F8 88 D5) */;

	internal ႥႥ()
	{
		this.Ⴈ = new List<UserCmdCfg>();
		Ⴈ();
	}

	private void Ⴈ()
	{
		char[] ⴗ = ႥႰ.Ⴗ;
		byte[] ⴅ = UserCmd.Ⴅ;
		int num = 7;
		while (true)
		{
			switch (num)
			{
			default:
			{
				this.Ⴈ.Add(new UserCmdCfg(WxFilters.Ⴀ(null, 4, 103387860), ClientCty.Ⴗ('ì', 4, 307013287)));
				char num2 = ⴗ[61];
				HighlightCtyCfg.ႠႠ[100] = (char)((HighlightCtyCfg.ႠႠ[100] | HighlightCtyCfg.ႠႠ[102]) & 0xF3);
				num = num2 - 17138;
				break;
			}
			case 6:
				this.Ⴈ.Add(new UserCmdCfg(Ⴅ(1673508154, this, 7), Ⴍ(0, 1580608889, '©', null)));
				num = ⴅ[18] - 33;
				break;
			case 1:
			case 3:
				this.Ⴈ.Add(new UserCmdCfg(WxFilters.Ⴀ(null, 5, 103387845), ClientCty.Ⴗ('ê', 3, 307013334)));
				goto case 4;
			case 4:
				num = 2;
				break;
			case 2:
			case 5:
				this.Ⴈ.Add(new UserCmdCfg(Ⴅ(1673508314, this, 4), Ⴍ(6, 1580608773, 'È', null)));
				num = 0;
				break;
			case 0:
				this.Ⴈ.Add(new UserCmdCfg(WxFilters.Ⴀ(null, 0, 103387872), WxFilters.Ⴀ(null, 5, 103387877)));
				return;
			}
		}
	}

	[SecuritySafeCritical]
	static ႥႥ()
	{
		char[] array = new char[8];
		array[7] = '⫈';
		array[1] = '➮';
		array[4] = '⼆';
		array[3] = '⦺';
		array[2] = '⢭';
		array[6] = '㋯';
		array[0] = '\u05b6';
		array[5] = '\u1fd4';
		ႤႥ = new string[100];
		Ⴀ = array;
		Ⴗ = new char[1899]
		{
			'\u2e7e', '\u2e7c', '\u2e7e', '\u1cfe', 'ㇾ', '蓤', '蓪', '蓥', '깭', '뙅',
			'鬍', 'ꮖ', '괰', '갦', 'ꌉ', '脠', '깉', '뙿', '魄', 'ꮍ',
			'괮', '갚', '\udc32', '\udc39', '\udc30', '쎔', '\uf351', '\uf5e0', '\uf4eb', 'ﯽ',
			'\ud9e1', '\uf6ad', '\ueefd', '쎧', '\uf367', '\uf5dd', '襇', '襃', '襄', 'ꘖ',
			'ꂩ', 'ꆥ', '꺥', '䟂', '䟅', '䟆', '畟', '塳', '械', '渌',
			'漀', '怜', '䈧', '缸', '缲', '缽', '囻', '埡', '壕', '竼',
			'喕', '䶣', '悘', '偑', '囲', '埆', 'ޙ', 'ޒ', 'ޟ', '⁃',
			'Ɂ', 'ⴾ', '㔵', 'ᠿ', '⣺', '⹗', '⽀', '⁘', 'ɟ', 'ⴂ',
			'ぞ', 'ご', 'す', 'ʑ', '\u2fef', 'ἰ', 'ᦇ', 'ᢒ', 'ន', '㗈',
			'\u1acf', '\u02e5', '⿉', '皆', '皗', '皎', '市', '兌', '獕', '尽',
			'䐚', '椷', '姣', '当', '幙', '兘', '猐', '尽', '䐌', '椼',
			'姩', '彐', '帋', '\uf8fc', '\uf8ec', '\uf8f5', '\ue746', '힕', '턯', '퀢',
			'\udf3c', 'ﴯ', '퉀', '쩫', '\ue76d', 'ퟚ', '턾', '퀕', '\udf72', '﴾',
			'퉱', '쩀', '냻', '냼', '냱', '験', '舮', '꼌', '龘', '餯',
			'頿', '霹', '\udb09', '\udb08', '\udb02', '\uf293', '緇', '緍', '緋', '砂',
			'坽', '位', '扠', '劔', '呝', '唝', '娆', '砹', '坜', '䦴',
			'䦵', '䦹', '曉', '訪', '訥', '訤', '뢠', '閖', 'ꕏ', 'ꏱ',
			'ꋄ', '귧', '迿', 'ꂚ', '뢁', '閊', 'ꕂ', 'ꏵ', 'ꋮ', '귨',
			'迟', '\u0ac2', '\u0ad7', '\u0acd', '㡈', 'ᕾ', '▧', '⌙', '∬', 'ⴘ',
			'༇', '\u2063', '㡩', 'ᕱ', '■', '⌰', '∖', 'ⴘ', '\u0f37', '⁾',
			'㡃', 'ᕳ', '▭', '⌔', '∬', '⏈', '⏝', '⏘', 'ᅂ', '㱴',
			'ಭ', 'ਓ', 'ଦ', 'Ї', '☗', '।', 'ᅂ', '㱱', 'ಧ', 'ਆ',
			'ଉ', 'Г', '☳', 'ॴ', 'ᅉ', '㱹', 'ಧ', 'ਞ', 'ଦ', '埄',
			'埅', '埕', '濙', '⋼', '⋨', '⋮', 'Դ', '✣', 'ࡆ', 'ၶ',
			'㵻', '\u0dda', 'ଵ', '\u0a3f', 'Գ', '✙', 'ࠔ', '\u1067', '㵎', 'ඕ',
			'ଵ', '\u0a3e', 'Ԡ', '✩', '\u085d', '\u105e', '\ue332', '\ue336', '\ue321', '\ue6e1',
			'즗', '톴', 'ﲲ', 'ᬍ', 'ᬏ', 'ᬙ', 'Ө', '㑍', '鎂', '鎆',
			'鎗', '볳', '멌', '뭀', '둠', '퓣', '퓧', '퓵', 'ﴶ', 'ﰠ',
			'\uf339', '턔', '缐', '缕', '缇', '囓', '埙', '壚', '竓', '喚',
			'\udae4', '\udaf5', '\udafc', '\uf058', '\ue878', '앙', '\uf58e', '\uf37e', '\uf230', 'ﴮ',
			'\udf36', '\uf059', '\ue869', '씐', '\uf587', '\uf336', '\uf23d', 'ﵪ', '\udf3c', '\uf063',
			'鮦', '鮿', '鮿', '뉻', '덪', '뱤', '鹶', '녎', '\ua92d', '萛',
			'듌', '뉽', '덽', '밨', '鹢', '넋', 'ꤤ', '萟', '듉', '뉷',
			'던', '밨', '鹘', '넡', 'ꤋ', '葃', '듴', '뉟', '옐', '옊',
			'옊', '쏁', '\uecb9', '\uf493', '\ud9a2', '\ue936', '\uefce', '\ueed8', '\ue1ca', '쏕',
			'\uecad', '\uf4bd', '\ud9e4', '\ue964', '\uefcf', '\ueed0', '\ue1d3', '쏏', '\uecb3', '\uf4ac',
			'\ud9e4', '\ue95e', '\uefe5', '\ueeff', '\ue18f', '쏲', '\uec9b', '㧶', '㦾', '㧭',
			'\u1038', 'ᄴ', 'Ḩ', '㰳', 'ጞ', '୫', '♇', '\u169d', 'အ', 'ᄲ',
			'ḳ', '㰳', 'ጞ', '\u0b7c', '♖', 'ᚑ', '\u102f', 'ᄲ', 'Ḵ', '㰰',
			'ፋ', '\u0b7d', '☂', 'ᚑ', '\u106c', 'ᄼ', 'Ḷ', '㰩', 'ፊ', '\u0b78',
			'♁', 'ᚙ', 'ဨ', 'ᄵ', 'ḱ', '㱠', 'ፙ', '\u0b78', '♎', 'ᚶ',
			'\u0fdc', '࿁', '࿀', '☤', '✕', '⡒', '\u0a04', '╽', '㴓', '\u1060',
			'₮', '☁', '✟', '⠗', 'ਘ', '╠', '㵀', 'ဨ', '₶', '☇',
			'✟', '⠕', '\u0a03', '╧', '㴓', 'ၺ', '₿', '☋', '✜', '⠛',
			'\u0a01', '╇', '禥', '禼', '禸', '匞', '䬸', '昔', '囗', '偫',
			'內', '幻', '籠', '卍', '䬯', '昄', '囒', '偶', '兦', '幾',
			'簳', '匋', '䬥', '晑', '囑', '偺', '兪', '幦', '籦', '匣',
			'\ue25e', '\ue219', '\ue240', '얕', '\ue79b', '죷', '탓', '\ufdeb', '촬', '쮅',
			'쪗', '에', '\ue786', '죱', '탘', 'ﷹ', '촴', '쮈', '쪒', '얓',
			'\ue7c8', '죓', '탧', 'ﶪ', '촪', '쮋', '쫓', '얳', '\ue7ab', '죐',
			'킑', '\ufdef', '촰', '쮐', '쫓', '얞', '\ue781', '좶', '택', '\ufde6',
			'촹', '쮧', '\ud9dd', '\ud9d7', '\ud9c2', '\ueb40', '왬', '\uf6b9', '\uf00a', '\uf115',
			'\ufe1e', '\udc4b', '\uf356', '\ueb7d', '왏', '\u17c8', '\u17cc', '៨', 'ࡸ', '㢧',
			'㸀', '㼢', '뚶', '뚠', '뚗', '萼', 'ꤐ', '駑', '齹', '鹪',
			'酋', '댠', '鰚', '萰', 'ꤐ', '駷', '鼬', '鹿', '酹', '덥',
			'鰖', '萷', '꤇', '駔', '齥', '鹺', '酕', '婬', '婩', '婎',
			'棦', '䗌', '甋', '玢', '犒', '㢅', '㢉', '㢦', '✿', '\u17ec',
			'ᅖ', 'ၜ', 'Ὀ', '㵖', 'ሞ', '\u0a4a', '✝', '\u17d1', 'ᅭ', '\u1069',
			'\u0ff6', '\u0ffe', '࿒', 'ਥ', '═', '㵶', 'ၸ', '\u20d0', '☙', '✏',
			'⠑', '瀀', '瀌', '瀥', '媭', '䊛', '澵', '彲', '姉', '壟',
			'埋', '痂', '媼', '䊀', '澤', '彵', '濷', '濴', '濑', '灐',
			'䂞', '䘨', 'Ṩ', 'ṯ', 'ṏ', '㒉', '⳾', 'ǈ', 'ㄞ', '㞿',
			'㚀', '㧮', '\ufe26', '\ufe28', '\ufe0e', 'ﯵ', '풀', '첦', '\ue1a8', '텕',
			'ퟨ', '훂', '\ud9fa', 'ﯵ', '풚', '첽', '\ue19d', '텐', 'ퟏ', '⢟',
			'⢜', '⢶', '\u1a19', '㜭', 'ߊ', '럜', '럝', '럶', '鼺', '몥',
			'몦', '몎', '뽑', '逢', '蠈', '짝', '짞', '짱', '\ufb12', '혳',
			'\ue686', '㡷', '㡸', '㡚', '㷨', '\u12c6', '૬', '⟓', '\u171c', 'ᆨ',
			'ჲ', 'Ό', '㷻', 'ው', '\u0afd', '⟗', '\u171d', 'ᆤ', '\u109c', '\ufbb5',
			'ﮱ', 'ﮛ', '턉', '줳', '\ue419', '퓶', '钣', '钫', '钌', '뱁',
			'덎', '酜', '빅', '꘩', '謓', '믊', '뵗', '㼵', '㼥', '㼅',
			'₊', '၁', 'ᛠ', '\u17ef', 'ᣯ', '㫦', 'ᖳ', 'ඨ', '₄', '၇',
			'\u16fc', '\u17ed', '\u18f7', '㫀', 'ᖅ', 'ඞ', '鶨', '鶬', '鶙', '늎',
			'됲', '딥', '먦', 'ທ', '\u0e85', 'ລ', '⤙', 'ଛ', '\u2430', '㰌',
			'ᅣ', '⇥', '❈', '♉', '⤙', '\u0b53', '\u243a', '㰌', 'ᄯ', '⇸',
			'❋', '☚', '⥡', '\u0b65', '\ua7ef', 'ꟷ', '\ua7dc', '袚', '踻', '輭',
			'耨', 'ꈭ', '赆', '镲', '롎', '袎', '踼', '輤', '耯', 'ꈶ',
			'赤', '锠', '롏', '袁', '踲', '輫', '耭', 'ꈱ', '赀', '镩',
			'롳', '헛', '험', '헯', 'ﵛ', '\uf22d', '퀺', '몀', '몁', '몵',
			'飌', '쳧', '쳣', '쳑', '퍖', '\ue397', '\ue53c', '\ue419', '髻', '髺',
			'髌', '귱', '꿿', '꿾', '꿇', 'ꂘ', '崣', '崯', '崚', '爅',
			'瓼', '痦', '竮', '壴', '瞈', '濬', '䊎', '牁', '瓽', '痻',
			'竏', '깡', '긻', '깛', '覸', 'ꮸ', '蓍', '鳠', '뇜', '脐',
			'蟻', '蚸', '覠', 'ꮧ', '蓚', '鲮', '뇈', '脾', '螞', '蚇',
			'覴', '꯷', '蓌', '鳦', '뇁', '腇', '螳', '蚯', '覡', 'ꮢ',
			'蓈', '鳢', '놕', '脃', '螵', '蚭', '觯', 'ꮣ', '蓊', '鳫',
			'뇙', '脂', '螨', '蛬', '覠', 'ꮣ', '蒉', '鳼', '뇐', '脓',
			'螷', '蚥', '覩', '꯷', '蓇', '鳡', '놕', '脌', '螸', '蚥',
			'覣', 'ꮔ', '갛', '객', '갠', '蓩', '课', 'ꦘ', '蚑', '麵',
			'돳', '뤧', '뤦', '뤛', '诸', '춢', '춭', '춟', '졠', '\ue719',
			'＼', '툤', '\ue2ca', '\ue471', '\ue568', '\uea63', '졘', '\ue735', '＆', '퉃',
			'\ue2e6', '\ue459', '\ue533', '₂', 'ₙ', '₼', 'ሃ', '㼹', '\u0fed', '\u094c',
			'ࡌ', '\u0749', '╚', 'ਤ', 'ሂ', '㼵', '\u0fa4', 'ढ़', 'ࡋ', '\u0743',
			'╚', '੪', 'ሟ', '㼳', '\u0ff0', '\u094b', '\u085a', '\u0740', '╷', '੧',
			'ሮ', '㼄', '࿅', 'ﳟ', 'ﲓ', 'ﳠ', '\ue378', '펭', '픆', '퐗',
			'\udb1f', '龜', '홸', '칓', '\ue32b', '펾', '픋', '퐛', '\udb16', '癩',
			'홸', '친', '\ue32b', '펽', '픋', '퐓', '\udb51', '欄', '홤', '칕',
			'\ue37f', '펷', '픊', '퐑', '\udb51', '亂', '홸', '칖', '\ue32b', '펭',
			'픗', '퐝', '\udb01', '雷', '홣', '칕', '\ue365', '펵', '픀', '퐦',
			'\u169f', 'ᚌ', 'ᛟ', '㽑', '㹗', 'ㅟ', 'ጇ', '㰻', '␙', 'प',
			'㧴', '㽠', '㹋', 'ㅼ', '፩', '㰻', '␙', 'प', '㧴', '㽠',
			'㹋', 'ㅼ', '휝', '휌', '흜', 'ﶡ', '\ue597', '좧', '\uf835', 'ﻕ',
			'ￕ', '\uf0c5', '틙', 'ﶰ', '\ue581', '좰', '\uf876', 'ﺉ', 'ￜ', '\uf0da',
			'틊', 'ﶸ', '썁', '썓', '쌃', '\uec69', '\uea9f', '\ueb89', '\ue48b', '욖',
			'\ue9e6', '\uf1c2', '\udcb5', '\uec34', '\uea9e', '\ueb85', '\ue49d', '욃', '\ue9e7', '\uf1db',
			'\udcfa', '\uec24', '\ueadb', '윐', '윒', '읓', '\ue0ed', '싧', '\uef47', '\uef45',
			'\uef03', '\uddeb', '\uf0dc', '冥', '冩', '几', '丐', '绊', '硻', '祭',
			'癦', '吙', '筀', '挣', '丅', '经', '硪', '祅', '頋', '瞧',
			'揄', '졖', '\ue57a', '햹', '팝', '툏', '\udd03', '｝', '큢', '졍',
			'\ue57b', '햨', '팜', '툏', '\udd11', '１', '큶', '졉', '\ue53f', '햨',
			'팙', '툒', '\udd45', '／', '크', '졂', '\ue53f', '햹', '팝', '툓',
			'\udd04', '；', '큦', '졀', '\ue53f', '햨', '팙', '툒', '\udd45', '／',
			'큦', '졐', '\ue573', '햤', '팗', '퉆', '\udd16', '４', '큫', '졐',
			'\ue53f', '햨', '팚', '툇', '\udd28', '돆', '돀', '뎁', '饫', '腝',
			'걷', '鲬', '騙', '鬯', '\ue7cc', '\ue7dd', '\ue784', '츪', '켏', '쀋',
			'\ue21d', '쵫', '핯', '\uf86c', '좤', '츓', '켈', '쀎', '\ue239', '쵘',
			'필', '\uf87e', '좉', '츪', 'ҕ', 'О', 'Ӝ', '⍇', 'ă', '\u2e7d',
			'㙚', '᭡', '⮳', 'ⴏ', 'Ⱈ', '⌛', 'ă', '\u2e7d', '㘗', '\u1b35',
			'⯻', 'ⴁ', 'ⱀ', '⍿', 'ŀ', 'ⸯ', '㘻', '\u1b6e', '⯿', 'ⵎ',
			'ⱍ', '⍕', 'ł', '⸐', '㘈', 'ᬤ', '⯠', '\u2d7a', 'Ⱇ', '⌍',
			'ő', '⸸', '㘬', 'ᬲ', '⯰', 'ⵀ', 'ⱼ', '⍘', 'ő', '⸜',
			'㙕', '\u1b35', '⯶', 'ⵁ', 'Ⱆ', '⍐', 'Ė', '⸿', '㘛', '\u1b6f',
			'⯤', 'ⵘ', 'ⱏ', '⌔', 'Č', '\u2e67', '㘊', '\u1b35', '⯧', 'ⵇ',
			'Ⱈ', '⌛', 'ă', '\u2e7d', '㙚', '᭡', '⮳', 'ⴏ', 'Ⱈ', '⌛',
			'ă', '⸡', '\ue50a', '\ue581', '\ue540', '쾾', 'ퟅ', '\ufafe', '쨬', '첐',
			'춇', '슄', '\ue09c', '쿢', 'ퟅ', '\ufafe', '쨬', '첐', '춇', '슄',
			'\ue09c', '쿢', 'ퟅ', '\ufafe', '쨬', '첐', '춇', '슄', '\ue0c8', '쾧',
			'힋', '\ufaf0', '쩧', '첅', '췅', '싅', '\ue092', '쾵', '힒', '睊',
			'쨣', '첟', '춝', '싔', '\ue0c8', '쾶', '힍', '\ufafe', '쨬', '첊',
			'췓', '싅', '\ue09c', '쾭', '힃', '練', '쩥', '첐', '췂', '싖',
			'\ue0d3', '쾏', 'ퟅ', '\ufafe', '쨬', '첐', '춇', '슄', '\ue09c', '쿢',
			'ퟅ', '\ufafe', '쨬', '첐', '춇', '슄', '\ue09c', '쿢', 'ퟅ', '甆',
			'\uf26d', '\uf26b', '\uf226', '\uf7e1', '\ud8cb', '샫', '\uedde', '\udd04', '\udbbb', '\udba4',
			'\udbb4', '\udbe8', '\uf263', '\uf345', 'ﱆ', '\ude53', '\uf12f', '\ue919', '쐵', '\uf4f1',
			'\uf24b', '\uf372', 'ﰪ', '\ude7d', '\uf100', '\ue927', '쐕', '\uf4ea', 'ᨿ', '\u1abd',
			'\u1a72', 'ᾳ', 'や', '⢵', 'և', '㕉', '㏨', '㋳', '㷩', 'ῌ',
			'プ', '⣰', '\u05c5', '㕝', '㏫', '㋳', '㷼', 'ῤ', '\u3098', '⢳',
			'\u05cb', '㕋', '㏠', '㋦', '㷽', 'ῠ', 'ケ', '⣰', '\u05b3', '㕽',
			'㎥', '㋦', '㷴', 'Ὶ', 'プ', '⢵', 'փ', '㕍', '㎥', '㋺',
			'㷥', 'ῠ', 'む', '⣰', '\u0598', '㕋', '㏠', '㋦', '㷽', 'ῠ',
			'ゑ', '⣰', '\u0599', '㕌', '㏪', '㋫', '㶱', '\u1ffd', 'を', '⢣',
			'\u05cb', '㕜', '㏶', '㋳', '㷴', 'ῥ', 'ェ', '딲', '딼', '땼',
			'銲', '냶', '龕', '螯', 'ꪔ', '驑', '鲨', '鷻', '鋲', '냥',
			'龗', '螰', 'ꪉ', '驷', 'ꉭ', 'ꉯ', 'ꈢ', '郺', '뷮', '鿯',
			'鿩', '龿', '땞', '굴', '聒', '낝', '똻', '뜇', 'ㅮ', 'ㅬ',
			'ㄿ', 'ḿ', 'ᢗ', '謹', '謁', '\ufaed', '툢', '\udd27', 'Ｘ', '爳',
			'爱', '牠', '壋', '䃤', '欏', '欍', '歛', '䐹', '䊁', '㩯',
			'㩭', '㨺', '\u1df1', '㿪', 'Ђ', 'Ѐ', 'є', '㛝', 'ᯤ', '嵆',
			'嵄', '崑', '瓋', '痚', '\ue9cd', '\ue9cf', '\ue995', '\uec4e', '쌴', '뽯',
			'뽭', '뼶', 'ꂉ', '遘', '袅', '袇', '裟', 'ꀘ', '꼚', '닑',
			'닐', '늊', '耈', '솝', '솚', '쇁', '쑌', '\ueb3b', '\uf31b', '\ude2d',
			'\ueef5', '\ue842', '\ue960', '쏛', '쎚', '쎆', '\ueca9', '\uea00', '\ueb12', '\ue45b',
			'옃', '\ue97a', '\uf153', '\udc60', '\uec91', '\uea04', '\ueb1b', '\ue41a', '옎', '\ue97f',
			'\uf151', '\udc58', '\uec81', '\uea0f', '\ueb1f', '\ue412', '옂', '\ue95f', '\uf140', '\udc61',
			'\uecb8', '\uea08', '\ueb1a', '\ue436', '옱', '\ue974', '\uf152', '\udc4c', '\uec81', '敀',
			'攈', '攞', '侨', '垕', '竺', '䨯', '䲝', '䶂', '䊢', '惖',
			'侨', '垏', '窺', '䨨', '䲝', '䶄', '䊝', '悚', '俤', '城',
			'竷', '䩦', '䲞', '䶄', '䊂', '悗', '俾', '垏', '竵', '䩦',
			'䲈', '䶈', '䊚', '悘', '俭', '垏', '竱', '䨵', '䲛', '䶈',
			'䊂', '悦', 'ゅ', 'む', 'ペ', 'ᨨ', 'Ȏ', '⽱', 'ᾰ', 'ᤈ',
			'\u081d', '\u0817', 'ࡽ', '❦', '⇫', '\u20fc', '⿲', '෨', '⊁', '㪡',
			'ឆ', '❓', '⇜', '뫻', '뫲', '몚', '뼺', '遜', '衰', 'ꕁ',
			'閔', '錖', '鈠', '鴢', '뼚', 'ꐇ', 'ꐄ', 'ꑥ', '隡', '뮕',
			'譒', '\uf2be', '\uf2b6', '\uf2dd', '픣', '\uf736', '\ud813', '쀤', '\ued1b', '\uddd1',
			'\udb6a', '\uda46', '甴', '甤', '畐', '婗', '峭', '巷', '勯', '热',
			'徒', '䞵', '檡', '婞', '峢', '巬', '勜', '烻', '徝', '䞷',
			'檰', '㒦', '㒠', '㓃', '⬄', 'ᯁ', 'ᵋ', '\u1c25', '፦', 'ㅟ',
			'ꕚ', 'ꕝ', 'ꔼ', '迤', '韔', '뫙', '該', '貚', '趟', '芹',
			'\ued8f', '\ued83', '\uede8', '\udf16', '\uf23a', '싞', '쐛', '앇', '쩍', '\ue85b',
			'윦', '\udf14', '\uf229', '싦', '쑥', 'ꋛ', 'ꋗ', 'ꊳ', '뵠', '趔',
			'謀', '訟', '蔑', '\ua708', '衾', '遝', '뵻', '趱', '謔', '註',
			'嫏', '媝', '媦', '牨', '絗', '彰', '瀷', '树', '䔒', '痻',
			'獄', '牫', '絔', '彈', '瀎', '栗', '䔪', '痀', '獅', '牐',
			'絨', '彉', '瀴', '栩', '䔫', '痽', '獼', '牒', '絙', '彰',
			'瀷', '栖', '䔪', '痀', '猬', '父', '紵', '弫', '瀎', '桷',
			'䕘', '痀', '猐', '爌', '紎', '弑', '灗', '栩', '䕿', '疬',
			'猍', '爋', '紬', '쀢', '쀳', '쁈', '\uf2be', '\udf82', '\uef4a', '\ue9fd',
			'\ue8e2', '\ue7e9', '엷', '\uea84', '\uf2b8', '\udf99', '\uef4a', '\ue9f6', '\ue8ce', '\ue7ac',
			'엕', '\ueab9', '\uf298', '텇', '텕', '턬', '\uf8d3', '年', '\uf68c', '풃',
			'ﯮ', '\ue3cd', '컿', '\ufe22', '\uf8dd', '輦', '\uf68c', '풅', 'ﯣ', '\ue3c1',
			'컵', '﹡', '\uf8a5', '瑩', '해', '핡', '픘', 'ﳠ', 'ﶫ', '\uf2bf',
			'킶', '\uffd0', '\ue7f2', '쫆', '禍', 'ﲩ', 'ﶷ', '\uf2b3', '킶', '\uffc8',
			'\ue7fe', '쫓', '禍', 'ﲼ', 'ﶶ', '\uf2a8', '킰', '\ufff9', '\uda79', '\uda6e',
			'\uda14', '엞', '\uf50b', '\uf3ac', '\uf2a4', 'ﶄ', '\udfef', '\uf0d6', '\ue8e4', '엢',
			'\uf55f', '\uf3a2', '\uf2b7', 'ﶾ', '\udfbd', '\uf0d4', '\ue8fb', '여', '\uf55f', '\uf3ab',
			'\uf2a0', 'ﶥ', '\udfa0', '\uf0ff', '뽕', '뼐', '뼻', 'ꂨ', '遢', '雑',
			'鞝', '颎', '몒', '间', '跔', 'ꃔ', '遳', '隫', '鞶', '颺',
			'뫃', '闯', '跟', 'ꃬ', '逾', '隆', '鞓', '風', '뫋', '閽',
			'跈', 'ꃮ', '遳', '隝', '鞝', '颖', '몎', '间', '跑', 'ꃒ',
			'遳', '際', '鞗', '颵', '闀', '闌', '閯', '몴', '밟', '봊',
			'눏', '逘', '뽩', 'Ꝣ', '試', '몣', '밗', '봄', '눺'
		};
		char[] array2 = new char[8];
		array2[0] = '\u05b6';
		array2[2] = '⢭';
		array2[5] = '\u1fd4';
		array2[3] = '⦺';
		array2[7] = '⫈';
		array2[1] = '➮';
		array2[4] = '⼆';
		array2[6] = '㋯';
		Ⴃ = new string[112];
		Ⴄ = array2;
		ArcClientConnectDat.Ⴍ();
	}

	internal static string Ⴅ(int P_0, ႥႥ P_1, int P_2)
	{
		char[] ⴄ = Bye.Ⴄ;
		byte[] ⴅ = UserCmd.Ⴅ;
		char[] ⴗ = ႥႰ.Ⴗ;
		IEnumerable enumerable = default(IEnumerable);
		int num6 = default(int);
		object obj5 = default(object);
		Array array = default(Array);
		object obj2 = default(object);
		char c = default(char);
		int num7 = default(int);
		int num5 = default(int);
		int num8 = default(int);
		int num4 = default(int);
		while (true)
		{
			int num = P_0 ^ 0x63BFB54C ^ P_2;
			object ⴗ2 = Ⴗ;
			char[] obj = (char[])ⴗ2;
			int num2 = obj[num];
			num2 = obj[num + 2] ^ num2;
			int num3 = ⴄ[109] - 56962;
			while (true)
			{
				switch (num3)
				{
				default:
					/*OpCode not supported: LdMemberToken*/;
					num3 = 9;
					continue;
				case 9:
					break;
				case 6:
					num3 = (((enumerable = ((string[])Ⴃ)[num2]) == null) ? (ⴗ[122] - 26784) : (ⴅ[5] - ⴅ[205]));
					continue;
				case 1:
					return (string)enumerable;
				case 17:
				{
					char[] obj3 = (char[])ⴗ2;
					char[] obj4 = (char[])Ⴄ;
					num6 = num;
					obj5 = obj4;
					array = obj3;
					num3 = 14;
					continue;
				}
				case 14:
					obj2 = new StringBuilder();
					c = ((char[])array)[num6];
					num7 = ((char[])array)[num6 + 1] ^ c;
					num3 = ⴗ[129] - 40411;
					continue;
				case 7:
				case 10:
					num6 += 3;
					num5 = (num7 & 0x1F) | ((num7 & 0xFFC0) >> 1);
					num3 = 5;
					continue;
				case 5:
					num3 = (((num7 & 0x20) == 0) ? 2 : 12);
					continue;
				case 12:
					num5 = (num5 << 15) | (((char[])array)[num6++] ^ c);
					num3 = 2;
					continue;
				case 2:
					num8 = ((char[])obj5).Length;
					num4 = 1;
					num3 = ⴅ[217] - 40;
					continue;
				case 15:
					(obj2 as StringBuilder).Append((char)(c ^ (array as char[])[num6 + num5 - num4] ^ ((char[])obj5)[(num4 + num6 + 17) % num8]));
					goto case 11;
				case 11:
					num3 = ⴄ[159] - 48354;
					continue;
				case 13:
					num4++;
					num3 = ⴄ[244] - 46890;
					continue;
				case 16:
					num3 = ((num4 <= num5) ? ⴅ[176] : 3);
					continue;
				case 3:
					enumerable = (obj2 as StringBuilder).ToString();
					goto case 4;
				case 4:
					((string[])Ⴃ)[num2] = enumerable as string;
					num3 = 8;
					continue;
				case 8:
					return enumerable as string;
				}
				break;
			}
		}
	}

	internal static string Ⴍ(int P_0, int P_1, char P_2, string P_3)
	{
		byte[] ⴅ = UserCmd.Ⴅ;
		char[] ⴀႠ = HighlightCtyCfg.ႠႠ;
		char[] ⴗ = ႥႰ.Ⴗ;
		char[] ⴄ = Bye.Ⴄ;
		object obj2 = default(object);
		int num6 = default(int);
		Array array = default(Array);
		object obj4 = default(object);
		object obj3 = default(object);
		char c = default(char);
		int num7 = default(int);
		int num5 = default(int);
		int num8 = default(int);
		int num4 = default(int);
		while (true)
		{
			int num = P_1 ^ 0x5E362D56 ^ P_0;
			while (true)
			{
				IL_0082:
				object ⴜ = Ⴜ;
				while (true)
				{
					IL_0088:
					char[] obj = (char[])ⴜ;
					int num2 = obj[num];
					num2 = obj[num + 2] ^ num2;
					int num3 = ⴅ[28] - 157;
					while (true)
					{
						switch (num3)
						{
						default:
							/*OpCode not supported: LdMemberToken*/;
							num3 = 0;
							continue;
						case 0:
							break;
						case 11:
							goto IL_0082;
						case 6:
							goto IL_0088;
						case 1:
							num3 = (((obj2 = ((string[])ႤႥ)[num2]) == null) ? (ⴀႠ[101] - 46672) : 8);
							continue;
						case 8:
							return (string)obj2;
						case 3:
						{
							char[] obj5 = (char[])ⴜ;
							char[] obj6 = (char[])Ⴀ;
							num6 = num;
							array = obj6;
							obj4 = obj5;
							num3 = ⴅ[188] + ⴅ[102];
							continue;
						}
						case 14:
							obj3 = new StringBuilder();
							c = (obj4 as char[])[num6];
							num7 = ((char[])obj4)[num6 + 1] ^ c;
							num3 = ⴗ[59] - 33045;
							continue;
						case 10:
							num6 += 3;
							num5 = (num7 & 0x1F) | ((num7 & 0xFFC0) >> 1);
							num3 = 9;
							continue;
						case 9:
							num3 = (((num7 & 0x20) == 0) ? 13 : 15);
							continue;
						case 5:
						case 15:
							num5 = (num5 << 15) | ((obj4 as char[])[num6++] ^ c);
							num3 = 13;
							continue;
						case 13:
							num8 = (array as char[]).Length;
							num4 = 1;
							num3 = ⴗ[143] - 39698;
							continue;
						case 17:
							((StringBuilder)obj3).Append((char)(c ^ (obj4 as char[])[num6 + num5 - num4] ^ (array as char[])[(num4 + num6 + 17) % num8]));
							num3 = 4;
							continue;
						case 4:
							num4++;
							num3 = 7;
							continue;
						case 7:
							num3 = ((num4 <= num5) ? (ⴄ[129] - 52890) : 2);
							continue;
						case 2:
							obj2 = ((StringBuilder)obj3).ToString();
							((string[])ႤႥ)[num2] = (string)obj2;
							num3 = ⴄ[39] - 46454;
							continue;
						case 16:
							return obj2 as string;
						}
						break;
					}
					break;
				}
				break;
			}
		}
	}

	[SecuritySafeCritical]
	internal static void ႤႨ<_0021_00210>(_0021_00210 P_0, ref bool P_1, short P_2, int P_3)
	{
		byte[] ⴅ = UserCmd.Ⴅ;
		char[] ⴄ = Bye.Ⴄ;
		char[] ⴀႠ = HighlightCtyCfg.ႠႠ;
		int num = 2;
		int num2 = default(int);
		while (true)
		{
			switch (num)
			{
			default:
				num2 = 0;
				num = ⴅ[44] - 216;
				continue;
			case 5:
				num = (((P_2 ^ P_3) - 113) ^ num2) switch
				{
					0 => ⴄ[85] - 12106, 
					_ => 3, 
				};
				continue;
			case 3:
				num = 1;
				continue;
			case 6:
			case 8:
				Monitor.Enter(P_0, ref P_1);
				goto case 1;
			case 1:
				num2++;
				break;
			case 4:
				break;
			case 0:
			case 7:
				return;
			}
			int num3 = 88;
			int num4 = 39;
			num = ((44 < num3 / 2 - num4) ? ⴅ[285] : (ⴀႠ[35] - ⴀႠ[35]));
		}
	}

	[SecuritySafeCritical]
	internal static void ႤႣ<_0021_00210>(_0021_00210 P_0, double P_1, short P_2, int P_3) where _0021_00210 : ZedGraphControl
	{
		byte[] ⴅ = UserCmd.Ⴅ;
		char[] ⴀႠ = HighlightCtyCfg.ႠႠ;
		char[] ⴄ = Bye.Ⴄ;
		int num = 3;
		int num3 = default(int);
		int num2 = default(int);
		while (true)
		{
			switch (num)
			{
			default:
				num3 = 0;
				num = ⴅ[51] - 238;
				break;
			case 10:
				num = (((P_3 ^ P_2) - 77) ^ num3) switch
				{
					0 => 7, 
					1 => 6, 
					_ => ⴀႠ[97] - 35000, 
				};
				break;
			case 2:
			case 4:
				num = 9;
				break;
			case 0:
			case 7:
				P_0.ScrollMinY = P_1;
				num = 9;
				break;
			case 6:
				P_0.ScrollMinY2 = P_1;
				goto case 9;
			case 9:
				num3++;
				num2 = P_2 * P_2;
				num2 = P_2 + num2;
				num = 8;
				break;
			case 8:
				num = ((num2 % 2 != 0) ? (ⴄ[139] - 9622) : ⴅ[285]);
				break;
			case 1:
			case 5:
				return;
			}
		}
	}

	[SecuritySafeCritical]
	internal static void ႤႳ<_0021_00210>(_0021_00210 P_0, Color P_1, char P_2, short P_3) where _0021_00210 : DataGridViewLinkColumn
	{
		byte[] ⴅ = UserCmd.Ⴅ;
		char[] ⴄ = Bye.Ⴄ;
		int num = 4;
		int num2 = default(int);
		while (true)
		{
			switch (num)
			{
			default:
				num2 = 0;
				num = 1;
				break;
			case 1:
				num = (((P_2 ^ P_3) - 50) ^ num2) switch
				{
					0 => 6, 
					_ => ⴅ[151] - ⴅ[208], 
				};
				break;
			case 9:
				num = 0;
				break;
			case 2:
			case 6:
				P_0.VisitedLinkColor = P_1;
				goto case 0;
			case 0:
				num2++;
				num = (((P_3 * P_3 + P_3) % 2 == 0) ? (ⴄ[201] - 44568) : 8);
				break;
			case 5:
			case 8:
				num = ⴄ[278] - 56976;
				break;
			case 7:
				return;
			}
		}
	}

	[SecuritySafeCritical]
	internal static void ႤႰ<_0021_00210>(_0021_00210 P_0, bool P_1, char P_2, short P_3) where _0021_00210 : TextBoxBase
	{
		char[] ⴄ = Bye.Ⴄ;
		char[] ⴗ = ႥႰ.Ⴗ;
		char[] ⴀႠ = HighlightCtyCfg.ႠႠ;
		int num = 7;
		int num2 = default(int);
		while (true)
		{
			switch (num)
			{
			default:
				num2 = 0;
				num = ⴄ[302] - 8852;
				break;
			case 3:
			case 9:
				num = (((P_2 ^ P_3) - 50) ^ num2) switch
				{
					0 => ⴄ[169] - 10933, 
					_ => ⴗ[158] - ⴗ[158], 
				};
				break;
			case 0:
				num = ⴄ[155] - 45033;
				break;
			case 6:
				P_0.Multiline = P_1;
				goto case 4;
			case 4:
				num2++;
				num = (((P_3 * P_3 + P_3) % 2 == 0) ? (ⴗ[145] - 59483) : 5);
				break;
			case 5:
				num = ⴀႠ[103] - 38470;
				break;
			case 1:
			case 2:
			case 8:
				return;
			}
		}
	}

	[SecuritySafeCritical]
	internal static void ႤႭ(int P_0, short P_1, short P_2)
	{
		char[] ⴄ = Bye.Ⴄ;
		byte[] ⴅ = UserCmd.Ⴅ;
		int num = 9;
		int num2 = default(int);
		while (true)
		{
			switch (num)
			{
			default:
				num2 = 0;
				num = ⴄ[154] - 60842;
				break;
			case 1:
				num = (((P_1 ^ P_2) - 36) ^ num2) switch
				{
					0 => 4, 
					_ => 2, 
				};
				break;
			case 2:
				num = 8;
				break;
			case 0:
			case 4:
				LogFileMaintenance.ScrubLogs(P_0);
				goto case 8;
			case 8:
				num2++;
				goto case 5;
			case 5:
			case 7:
			{
				int num3 = 309;
				int num4 = 746;
				num = ((4476 > num4 - num3 * 6) ? 6 : 3);
				break;
			}
			case 3:
				num = ⴅ[115] / 4;
				break;
			case 6:
				return;
			}
		}
	}

	[SecuritySafeCritical]
	internal static void ႤႠ<_0021_00210>(_0021_00210 P_0, float P_1, short P_2, short P_3) where _0021_00210 : CtyInfo
	{
		byte[] ⴅ = UserCmd.Ⴅ;
		char[] ⴀႠ = HighlightCtyCfg.ႠႠ;
		char[] ⴄ = Bye.Ⴄ;
		int num = 7;
		int num2 = default(int);
		while (true)
		{
			switch (num)
			{
			default:
				num2 = 0;
				num = 9;
				break;
			case 9:
				num = (((P_2 ^ P_3) - 36) ^ num2) switch
				{
					0 => 6, 
					_ => ⴅ[102] / 5, 
				};
				break;
			case 0:
			case 2:
				num = ⴅ[280] - 247;
				break;
			case 6:
				P_0.Range = P_1;
				goto case 3;
			case 3:
			{
				num2++;
				int num3 = 309;
				int num4 = 746;
				num = ((4476 > num4 - num3 * 6) ? (ⴄ[199] - 65145) : (ⴀႠ[35] - 25311));
				break;
			}
			case 4:
			case 5:
				num = ⴅ[161] - 211;
				break;
			case 1:
			case 8:
				return;
			}
		}
	}
}
